#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: teresa-turtle
#+author: William Henney
#+email: whenney@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport


**** Trying out FLCT

+ I do adjustments to the y velocity in order to improve the consistency between the two lines
+ First move so tha region around star has zero velocity
+ Then further adjustments by hand in order to improve the consistency between the two lines and make things more symmetric
  + Add 0.1 pixel/cadence to [O III]
  + Subtract 0.1 pixel/cadence to [N II]
+ So the systematic uncertainty of about +/- 0.15 pix is probably the dominant error



First for [O III]

#+begin_src python :results output
  import sys
  sys.path.append("../../../Source/pyflct")
  import os
  import numpy as np
  import pyflct
  from astropy.io import fits
  from astropy.wcs import WCS

  os.environ["PATH"] = ":".join((os.environ["PATH"], "/Users/will/.local/bin"))

  h1 = fits.open("../propermotions/oiii/oiii-ago1997-correct.fits")['SCI']
  h2 = fits.open("../propermotions/oiii/oiii-ene2008-correct.fits")['SCI']

  xslice, yslice = slice(970, 1430), slice(880, 1440)
  data1 = h1.data[yslice, xslice]
  data2 = h2.data[yslice, xslice]

  vx, vy, vm = pyflct.flct(data1.T, data2.T,
                           deltat=1.0, deltas=1.0, sigma=10.0,
                           thresh=0.1/data1.max(),
  )
  vx[vm==0] = np.nan
  vy[vm==0] = np.nan

  # Position of star
  ra0, dec0 = 251.1230789, 23.7999977
  w = WCS(h1).slice((yslice, xslice))
  j0, i0 = w.world_to_array_index_values(ra0, dec0)
  # Correct for any shift of star
  vx -= vx[i0-3:i0+3, j0-3:j0+3].mean()
  vy -= vy[i0-3:i0+3, j0-3:j0+3].mean()
  # And a final by-hand shift to make things be more symmetric
  vy += 0.2

  newhdr = w.to_header()

  fits.PrimaryHDU(header=newhdr, data=data1).writeto(
      "../propermotions/oiii/oiii-ago1997-win.fits", overwrite=True)
  fits.PrimaryHDU(header=newhdr, data=data2).writeto(
      "../propermotions/oiii/oiii-ene2008-win.fits", overwrite=True)
  fits.PrimaryHDU(header=newhdr, data=vx.T).writeto(
      "../propermotions/oiii/oiii-velx-win.fits", overwrite=True)
  fits.PrimaryHDU(header=newhdr, data=vy.T).writeto(
      "../propermotions/oiii/oiii-vely-win.fits", overwrite=True)
#+end_src

#+RESULTS:
#+begin_example
flct: Version 1.07     Copyright: 2007-2018 University of California
flct: small endian machine; i/o will be byteswapped
flct: infile = testin.dat
flct: outfile = testout.dat
flct: column major order assumed for data arrays
flct: deltat = 1
flct: deltas = 1
flct: sigma = 10
flct: threshold image value for LCT is 0.000498
flct: bias correction not enabled
flct: complex.h is not included
flct: from input file, nx = 460, ny = 560
flct: nominal sliding box size = 40
flct: relative threshold in abs. units = 0.12458
flct: progress  i = 0 out of 559flct: progress  i = 1 out of 559flct: progress  i = 2 out of 559flct: progress  i = 3 out of 559flct: progress  i = 4 out of 559flct: progress  i = 5 out of 559flct: progress  i = 6 out of 559flct: progress  i = 7 out of 559flct: progress  i = 8 out of 559flct: progress  i = 9 out of 559flct: progress  i = 10 out of 559flct: progress  i = 11 out of 559flct: progress  i = 12 out of 559flct: progress  i = 13 out of 559flct: progress  i = 14 out of 559flct: progress  i = 15 out of 559flct: progress  i = 16 out of 559flct: progress  i = 17 out of 559flct: progress  i = 18 out of 559flct: progress  i = 19 out of 559flct: progress  i = 20 out of 559flct: progress  i = 21 out of 559flct: progress  i = 22 out of 559flct: progress  i = 23 out of 559flct: progress  i = 24 out of 559flct: progress  i = 25 out of 559flct: progress  i = 26 out of 559flct: progress  i = 27 out of 559flct: progress  i = 28 out of 559flct: progress  i = 29 out of 559flct: progress  i = 30 out of 559flct: progress  i = 31 out of 559flct: progress  i = 32 out of 559flct: progress  i = 33 out of 559flct: progress  i = 34 out of 559flct: progress  i = 35 out of 559flct: progress  i = 36 out of 559flct: progress  i = 37 out of 559flct: progress  i = 38 out of 559flct: progress  i = 39 out of 559flct: progress  i = 40 out of 559flct: progress  i = 41 out of 559flct: progress  i = 42 out of 559flct: progress  i = 43 out of 559flct: progress  i = 44 out of 559flct: progress  i = 45 out of 559flct: progress  i = 46 out of 559flct: progress  i = 47 out of 559flct: progress  i = 48 out of 559flct: progress  i = 49 out of 559flct: progress  i = 50 out of 559flct: progress  i = 51 out of 559flct: progress  i = 52 out of 559flct: progress  i = 53 out of 559flct: progress  i = 54 out of 559flct: progress  i = 55 out of 559flct: progress  i = 56 out of 559flct: progress  i = 57 out of 559flct: progress  i = 58 out of 559flct: progress  i = 59 out of 559flct: progress  i = 60 out of 559flct: progress  i = 61 out of 559flct: progress  i = 62 out of 559flct: progress  i = 63 out of 559flct: progress  i = 64 out of 559flct: progress  i = 65 out of 559flct: progress  i = 66 out of 559flct: progress  i = 67 out of 559flct: progress  i = 68 out of 559flct: progress  i = 69 out of 559flct: progress  i = 70 out of 559flct: progress  i = 71 out of 559flct: progress  i = 72 out of 559flct: progress  i = 73 out of 559flct: progress  i = 74 out of 559flct: progress  i = 75 out of 559flct: progress  i = 76 out of 559flct: progress  i = 77 out of 559flct: progress  i = 78 out of 559flct: progress  i = 79 out of 559flct: progress  i = 80 out of 559flct: progress  i = 81 out of 559flct: progress  i = 82 out of 559flct: progress  i = 83 out of 559flct: progress  i = 84 out of 559flct: progress  i = 85 out of 559flct: progress  i = 86 out of 559flct: progress  i = 87 out of 559flct: progress  i = 88 out of 559flct: progress  i = 89 out of 559flct: progress  i = 90 out of 559flct: progress  i = 91 out of 559flct: progress  i = 92 out of 559flct: progress  i = 93 out of 559flct: progress  i = 94 out of 559flct: progress  i = 95 out of 559flct: progress  i = 96 out of 559flct: progress  i = 97 out of 559flct: progress  i = 98 out of 559flct: progress  i = 99 out of 559flct: progress  i = 100 out of 559flct: progress  i = 101 out of 559flct: progress  i = 102 out of 559flct: progress  i = 103 out of 559flct: progress  i = 104 out of 559flct: progress  i = 105 out of 559flct: progress  i = 106 out of 559flct: progress  i = 107 out of 559flct: progress  i = 108 out of 559flct: progress  i = 109 out of 559flct: progress  i = 110 out of 559flct: progress  i = 111 out of 559flct: progress  i = 112 out of 559flct: progress  i = 113 out of 559flct: progress  i = 114 out of 559flct: progress  i = 115 out of 559flct: progress  i = 116 out of 559flct: progress  i = 117 out of 559flct: progress  i = 118 out of 559flct: progress  i = 119 out of 559flct: progress  i = 120 out of 559flct: progress  i = 121 out of 559flct: progress  i = 122 out of 559flct: progress  i = 123 out of 559flct: progress  i = 124 out of 559flct: progress  i = 125 out of 559flct: progress  i = 126 out of 559flct: progress  i = 127 out of 559flct: progress  i = 128 out of 559flct: progress  i = 129 out of 559flct: progress  i = 130 out of 559flct: progress  i = 131 out of 559flct: progress  i = 132 out of 559flct: progress  i = 133 out of 559flct: progress  i = 134 out of 559flct: progress  i = 135 out of 559flct: progress  i = 136 out of 559flct: progress  i = 137 out of 559flct: progress  i = 138 out of 559flct: progress  i = 139 out of 559flct: progress  i = 140 out of 559flct: progress  i = 141 out of 559flct: progress  i = 142 out of 559flct: progress  i = 143 out of 559flct: progress  i = 144 out of 559flct: progress  i = 145 out of 559flct: progress  i = 146 out of 559flct: progress  i = 147 out of 559flct: progress  i = 148 out of 559flct: progress  i = 149 out of 559flct: progress  i = 150 out of 559flct: progress  i = 151 out of 559flct: progress  i = 152 out of 559flct: progress  i = 153 out of 559flct: progress  i = 154 out of 559flct: progress  i = 155 out of 559flct: progress  i = 156 out of 559flct: progress  i = 157 out of 559flct: progress  i = 158 out of 559flct: progress  i = 159 out of 559flct: progress  i = 160 out of 559flct: progress  i = 161 out of 559flct: progress  i = 162 out of 559flct: progress  i = 163 out of 559flct: progress  i = 164 out of 559flct: progress  i = 165 out of 559flct: progress  i = 166 out of 559flct: progress  i = 167 out of 559flct: progress  i = 168 out of 559flct: progress  i = 169 out of 559flct: progress  i = 170 out of 559flct: progress  i = 171 out of 559flct: progress  i = 172 out of 559flct: progress  i = 173 out of 559flct: progress  i = 174 out of 559flct: progress  i = 175 out of 559flct: progress  i = 176 out of 559flct: progress  i = 177 out of 559flct: progress  i = 178 out of 559flct: progress  i = 179 out of 559flct: progress  i = 180 out of 559flct: progress  i = 181 out of 559flct: progress  i = 182 out of 559flct: progress  i = 183 out of 559flct: progress  i = 184 out of 559flct: progress  i = 185 out of 559flct: progress  i = 186 out of 559flct: progress  i = 187 out of 559flct: progress  i = 188 out of 559flct: progress  i = 189 out of 559flct: progress  i = 190 out of 559flct: progress  i = 191 out of 559flct: progress  i = 192 out of 559flct: progress  i = 193 out of 559flct: progress  i = 194 out of 559flct: progress  i = 195 out of 559flct: progress  i = 196 out of 559flct: progress  i = 197 out of 559flct: progress  i = 198 out of 559flct: progress  i = 199 out of 559flct: progress  i = 200 out of 559flct: progress  i = 201 out of 559flct: progress  i = 202 out of 559flct: progress  i = 203 out of 559flct: progress  i = 204 out of 559flct: progress  i = 205 out of 559flct: progress  i = 206 out of 559flct: progress  i = 207 out of 559flct: progress  i = 208 out of 559flct: progress  i = 209 out of 559flct: progress  i = 210 out of 559flct: progress  i = 211 out of 559flct: progress  i = 212 out of 559flct: progress  i = 213 out of 559flct: progress  i = 214 out of 559flct: progress  i = 215 out of 559flct: progress  i = 216 out of 559flct: progress  i = 217 out of 559flct: progress  i = 218 out of 559flct: progress  i = 219 out of 559flct: progress  i = 220 out of 559flct: progress  i = 221 out of 559flct: progress  i = 222 out of 559flct: progress  i = 223 out of 559flct: progress  i = 224 out of 559flct: progress  i = 225 out of 559flct: progress  i = 226 out of 559flct: progress  i = 227 out of 559flct: progress  i = 228 out of 559flct: progress  i = 229 out of 559flct: progress  i = 230 out of 559flct: progress  i = 231 out of 559flct: progress  i = 232 out of 559flct: progress  i = 233 out of 559flct: progress  i = 234 out of 559flct: progress  i = 235 out of 559flct: progress  i = 236 out of 559flct: progress  i = 237 out of 559flct: progress  i = 238 out of 559flct: progress  i = 239 out of 559flct: progress  i = 240 out of 559flct: progress  i = 241 out of 559flct: progress  i = 242 out of 559flct: progress  i = 243 out of 559flct: progress  i = 244 out of 559flct: progress  i = 245 out of 559flct: progress  i = 246 out of 559flct: progress  i = 247 out of 559flct: progress  i = 248 out of 559flct: progress  i = 249 out of 559flct: progress  i = 250 out of 559flct: progress  i = 251 out of 559flct: progress  i = 252 out of 559flct: progress  i = 253 out of 559flct: progress  i = 254 out of 559flct: progress  i = 255 out of 559flct: progress  i = 256 out of 559flct: progress  i = 257 out of 559flct: progress  i = 258 out of 559flct: progress  i = 259 out of 559flct: progress  i = 260 out of 559flct: progress  i = 261 out of 559flct: progress  i = 262 out of 559flct: progress  i = 263 out of 559flct: progress  i = 264 out of 559flct: progress  i = 265 out of 559flct: progress  i = 266 out of 559flct: progress  i = 267 out of 559flct: progress  i = 268 out of 559flct: progress  i = 269 out of 559flct: progress  i = 270 out of 559flct: progress  i = 271 out of 559flct: progress  i = 272 out of 559flct: progress  i = 273 out of 559flct: progress  i = 274 out of 559flct: progress  i = 275 out of 559flct: progress  i = 276 out of 559flct: progress  i = 277 out of 559flct: progress  i = 278 out of 559flct: progress  i = 279 out of 559flct: progress  i = 280 out of 559flct: progress  i = 281 out of 559flct: progress  i = 282 out of 559flct: progress  i = 283 out of 559flct: progress  i = 284 out of 559flct: progress  i = 285 out of 559flct: progress  i = 286 out of 559flct: progress  i = 287 out of 559flct: progress  i = 288 out of 559flct: progress  i = 289 out of 559flct: progress  i = 290 out of 559flct: progress  i = 291 out of 559flct: progress  i = 292 out of 559flct: progress  i = 293 out of 559flct: progress  i = 294 out of 559flct: progress  i = 295 out of 559flct: progress  i = 296 out of 559flct: progress  i = 297 out of 559flct: progress  i = 298 out of 559flct: progress  i = 299 out of 559flct: progress  i = 300 out of 559flct: progress  i = 301 out of 559flct: progress  i = 302 out of 559flct: progress  i = 303 out of 559flct: progress  i = 304 out of 559flct: progress  i = 305 out of 559flct: progress  i = 306 out of 559flct: progress  i = 307 out of 559flct: progress  i = 308 out of 559flct: progress  i = 309 out of 559flct: progress  i = 310 out of 559flct: progress  i = 311 out of 559flct: progress  i = 312 out of 559flct: progress  i = 313 out of 559flct: progress  i = 314 out of 559flct: progress  i = 315 out of 559flct: progress  i = 316 out of 559flct: progress  i = 317 out of 559flct: progress  i = 318 out of 559flct: progress  i = 319 out of 559flct: progress  i = 320 out of 559flct: progress  i = 321 out of 559flct: progress  i = 322 out of 559flct: progress  i = 323 out of 559flct: progress  i = 324 out of 559flct: progress  i = 325 out of 559flct: progress  i = 326 out of 559flct: progress  i = 327 out of 559flct: progress  i = 328 out of 559flct: progress  i = 329 out of 559flct: progress  i = 330 out of 559flct: progress  i = 331 out of 559flct: progress  i = 332 out of 559flct: progress  i = 333 out of 559flct: progress  i = 334 out of 559flct: progress  i = 335 out of 559flct: progress  i = 336 out of 559flct: progress  i = 337 out of 559flct: progress  i = 338 out of 559flct: progress  i = 339 out of 559flct: progress  i = 340 out of 559flct: progress  i = 341 out of 559flct: progress  i = 342 out of 559flct: progress  i = 343 out of 559flct: progress  i = 344 out of 559flct: progress  i = 345 out of 559flct: progress  i = 346 out of 559flct: progress  i = 347 out of 559flct: progress  i = 348 out of 559flct: progress  i = 349 out of 559flct: progress  i = 350 out of 559flct: progress  i = 351 out of 559flct: progress  i = 352 out of 559flct: progress  i = 353 out of 559flct: progress  i = 354 out of 559flct: progress  i = 355 out of 559flct: progress  i = 356 out of 559flct: progress  i = 357 out of 559flct: progress  i = 358 out of 559flct: progress  i = 359 out of 559flct: progress  i = 360 out of 559flct: progress  i = 361 out of 559flct: progress  i = 362 out of 559flct: progress  i = 363 out of 559flct: progress  i = 364 out of 559flct: progress  i = 365 out of 559flct: progress  i = 366 out of 559flct: progress  i = 367 out of 559flct: progress  i = 368 out of 559flct: progress  i = 369 out of 559flct: progress  i = 370 out of 559flct: progress  i = 371 out of 559flct: progress  i = 372 out of 559flct: progress  i = 373 out of 559flct: progress  i = 374 out of 559flct: progress  i = 375 out of 559flct: progress  i = 376 out of 559flct: progress  i = 377 out of 559flct: progress  i = 378 out of 559flct: progress  i = 379 out of 559flct: progress  i = 380 out of 559flct: progress  i = 381 out of 559flct: progress  i = 382 out of 559flct: progress  i = 383 out of 559flct: progress  i = 384 out of 559flct: progress  i = 385 out of 559flct: progress  i = 386 out of 559flct: progress  i = 387 out of 559flct: progress  i = 388 out of 559flct: progress  i = 389 out of 559flct: progress  i = 390 out of 559flct: progress  i = 391 out of 559flct: progress  i = 392 out of 559flct: progress  i = 393 out of 559flct: progress  i = 394 out of 559flct: progress  i = 395 out of 559flct: progress  i = 396 out of 559flct: progress  i = 397 out of 559flct: progress  i = 398 out of 559flct: progress  i = 399 out of 559flct: progress  i = 400 out of 559flct: progress  i = 401 out of 559flct: progress  i = 402 out of 559flct: progress  i = 403 out of 559flct: progress  i = 404 out of 559flct: progress  i = 405 out of 559flct: progress  i = 406 out of 559flct: progress  i = 407 out of 559flct: progress  i = 408 out of 559flct: progress  i = 409 out of 559flct: progress  i = 410 out of 559flct: progress  i = 411 out of 559flct: progress  i = 412 out of 559flct: progress  i = 413 out of 559flct: progress  i = 414 out of 559flct: progress  i = 415 out of 559flct: progress  i = 416 out of 559flct: progress  i = 417 out of 559flct: progress  i = 418 out of 559flct: progress  i = 419 out of 559flct: progress  i = 420 out of 559flct: progress  i = 421 out of 559flct: progress  i = 422 out of 559flct: progress  i = 423 out of 559flct: progress  i = 424 out of 559flct: progress  i = 425 out of 559flct: progress  i = 426 out of 559flct: progress  i = 427 out of 559flct: progress  i = 428 out of 559flct: progress  i = 429 out of 559flct: progress  i = 430 out of 559flct: progress  i = 431 out of 559flct: progress  i = 432 out of 559flct: progress  i = 433 out of 559flct: progress  i = 434 out of 559flct: progress  i = 435 out of 559flct: progress  i = 436 out of 559flct: progress  i = 437 out of 559flct: progress  i = 438 out of 559flct: progress  i = 439 out of 559flct: progress  i = 440 out of 559flct: progress  i = 441 out of 559flct: progress  i = 442 out of 559flct: progress  i = 443 out of 559flct: progress  i = 444 out of 559flct: progress  i = 445 out of 559flct: progress  i = 446 out of 559flct: progress  i = 447 out of 559flct: progress  i = 448 out of 559flct: progress  i = 449 out of 559flct: progress  i = 450 out of 559flct: progress  i = 451 out of 559flct: progress  i = 452 out of 559flct: progress  i = 453 out of 559flct: progress  i = 454 out of 559flct: progress  i = 455 out of 559flct: progress  i = 456 out of 559flct: progress  i = 457 out of 559flct: progress  i = 458 out of 559flct: progress  i = 459 out of 559flct: progress  i = 460 out of 559flct: progress  i = 461 out of 559flct: progress  i = 462 out of 559flct: progress  i = 463 out of 559flct: progress  i = 464 out of 559flct: progress  i = 465 out of 559flct: progress  i = 466 out of 559flct: progress  i = 467 out of 559flct: progress  i = 468 out of 559flct: progress  i = 469 out of 559flct: progress  i = 470 out of 559flct: progress  i = 471 out of 559flct: progress  i = 472 out of 559flct: progress  i = 473 out of 559flct: progress  i = 474 out of 559flct: progress  i = 475 out of 559flct: progress  i = 476 out of 559flct: progress  i = 477 out of 559flct: progress  i = 478 out of 559flct: progress  i = 479 out of 559flct: progress  i = 480 out of 559flct: progress  i = 481 out of 559flct: progress  i = 482 out of 559flct: progress  i = 483 out of 559flct: progress  i = 484 out of 559flct: progress  i = 485 out of 559flct: progress  i = 486 out of 559flct: progress  i = 487 out of 559flct: progress  i = 488 out of 559flct: progress  i = 489 out of 559flct: progress  i = 490 out of 559flct: progress  i = 491 out of 559flct: progress  i = 492 out of 559flct: progress  i = 493 out of 559flct: progress  i = 494 out of 559flct: progress  i = 495 out of 559flct: progress  i = 496 out of 559flct: progress  i = 497 out of 559flct: progress  i = 498 out of 559flct: progress  i = 499 out of 559flct: progress  i = 500 out of 559flct: progress  i = 501 out of 559flct: progress  i = 502 out of 559flct: progress  i = 503 out of 559flct: progress  i = 504 out of 559flct: progress  i = 505 out of 559flct: progress  i = 506 out of 559flct: progress  i = 507 out of 559flct: progress  i = 508 out of 559flct: progress  i = 509 out of 559flct: progress  i = 510 out of 559flct: progress  i = 511 out of 559flct: progress  i = 512 out of 559flct: progress  i = 513 out of 559flct: progress  i = 514 out of 559flct: progress  i = 515 out of 559flct: progress  i = 516 out of 559flct: progress  i = 517 out of 559flct: progress  i = 518 out of 559flct: progress  i = 519 out of 559flct: progress  i = 520 out of 559flct: progress  i = 521 out of 559flct: progress  i = 522 out of 559flct: progress  i = 523 out of 559flct: progress  i = 524 out of 559flct: progress  i = 525 out of 559flct: progress  i = 526 out of 559flct: progress  i = 527 out of 559flct: progress  i = 528 out of 559flct: progress  i = 529 out of 559flct: progress  i = 530 out of 559flct: progress  i = 531 out of 559flct: progress  i = 532 out of 559flct: progress  i = 533 out of 559flct: progress  i = 534 out of 559flct: progress  i = 535 out of 559flct: progress  i = 536 out of 559flct: progress  i = 537 out of 559flct: progress  i = 538 out of 559flct: progress  i = 539 out of 559flct: progress  i = 540 out of 559flct: progress  i = 541 out of 559flct: progress  i = 542 out of 559flct: progress  i = 543 out of 559flct: progress  i = 544 out of 559flct: progress  i = 545 out of 559flct: progress  i = 546 out of 559flct: progress  i = 547 out of 559flct: progress  i = 548 out of 559flct: progress  i = 549 out of 559flct: progress  i = 550 out of 559flct: progress  i = 551 out of 559flct: progress  i = 552 out of 559flct: progress  i = 553 out of 559flct: progress  i = 554 out of 559flct: progress  i = 555 out of 559flct: progress  i = 556 out of 559flct: progress  i = 557 out of 559flct: progress  i = 558 out of 559flct: progress  i = 559 out of 559flct: mean value of gamma^2/sigma^2 = 0.251837

flct: finished
#+end_example


Now for [N II]

#+begin_src python :results output
  import sys
  sys.path.append("../../../Source/pyflct")
  import os
  import numpy as np
  import pyflct
  from astropy.io import fits
  from astropy.wcs import WCS

  os.environ["PATH"] = ":".join((os.environ["PATH"], "/Users/will/.local/bin"))

  h1 = fits.open("../propermotions/nii/n6210n-rescaled-1998.fits")[0]
  h2 = fits.open("../propermotions/nii/n6210n2008sm.fits")[0]

  data1 = h1.data
  data2 = h2.data

  vx, vy, vm = pyflct.flct(data1.T, data2.T,
                           deltat=1.0, deltas=1.0, sigma=10.0,
                           thresh=0.03/data1.max(),
  )
  vx[vm==0] = np.nan
  vy[vm==0] = np.nan
  # Position of star
  ra0, dec0 = 251.1230789, 23.7999977
  w = WCS(h1.header)
  j0, i0 = w.world_to_array_index_values(ra0, dec0)
  # Correct for any shift of star 
  # At this point, arrays are still in (x, y) format
  vx -= vx[i0-3:i0+3, j0-3:j0+3].mean()
  vy -= vy[i0-3:i0+3, j0-3:j0+3].mean()
  # And a final by-hand shift to make things be more symmetric
  vy -= 0.1

  newhdr = h1.header

  fits.PrimaryHDU(header=newhdr, data=vx.T).writeto(
      "../propermotions/nii/nii-velx-win.fits", overwrite=True)
  fits.PrimaryHDU(header=newhdr, data=vy.T).writeto(
      "../propermotions/nii/nii-vely-win.fits", overwrite=True)
#+end_src

#+RESULTS:
#+begin_example
flct: Version 1.07     Copyright: 2007-2018 University of California
flct: small endian machine; i/o will be byteswapped
flct: infile = testin.dat
flct: outfile = testout.dat
flct: column major order assumed for data arrays
flct: deltat = 1
flct: deltas = 1
flct: sigma = 10
flct: threshold image value for LCT is 0.005372
flct: bias correction not enabled
flct: complex.h is not included
flct: from input file, nx = 310, ny = 310
flct: nominal sliding box size = 40
flct: relative threshold in abs. units = 0.0299977
flct: progress  i = 0 out of 309flct: progress  i = 1 out of 309flct: progress  i = 2 out of 309flct: progress  i = 3 out of 309flct: progress  i = 4 out of 309flct: progress  i = 5 out of 309flct: progress  i = 6 out of 309flct: progress  i = 7 out of 309flct: progress  i = 8 out of 309flct: progress  i = 9 out of 309flct: progress  i = 10 out of 309flct: progress  i = 11 out of 309flct: progress  i = 12 out of 309flct: progress  i = 13 out of 309flct: progress  i = 14 out of 309flct: progress  i = 15 out of 309flct: progress  i = 16 out of 309flct: progress  i = 17 out of 309flct: progress  i = 18 out of 309flct: progress  i = 19 out of 309flct: progress  i = 20 out of 309flct: progress  i = 21 out of 309flct: progress  i = 22 out of 309flct: progress  i = 23 out of 309flct: progress  i = 24 out of 309flct: progress  i = 25 out of 309flct: progress  i = 26 out of 309flct: progress  i = 27 out of 309flct: progress  i = 28 out of 309flct: progress  i = 29 out of 309flct: progress  i = 30 out of 309flct: progress  i = 31 out of 309flct: progress  i = 32 out of 309flct: progress  i = 33 out of 309flct: progress  i = 34 out of 309flct: progress  i = 35 out of 309flct: progress  i = 36 out of 309flct: progress  i = 37 out of 309flct: progress  i = 38 out of 309flct: progress  i = 39 out of 309flct: progress  i = 40 out of 309flct: progress  i = 41 out of 309flct: progress  i = 42 out of 309flct: progress  i = 43 out of 309flct: progress  i = 44 out of 309flct: progress  i = 45 out of 309flct: progress  i = 46 out of 309flct: progress  i = 47 out of 309flct: progress  i = 48 out of 309flct: progress  i = 49 out of 309flct: progress  i = 50 out of 309flct: progress  i = 51 out of 309flct: progress  i = 52 out of 309flct: progress  i = 53 out of 309flct: progress  i = 54 out of 309flct: progress  i = 55 out of 309flct: progress  i = 56 out of 309flct: progress  i = 57 out of 309flct: progress  i = 58 out of 309flct: progress  i = 59 out of 309flct: progress  i = 60 out of 309flct: progress  i = 61 out of 309flct: progress  i = 62 out of 309flct: progress  i = 63 out of 309flct: progress  i = 64 out of 309flct: progress  i = 65 out of 309flct: progress  i = 66 out of 309flct: progress  i = 67 out of 309flct: progress  i = 68 out of 309flct: progress  i = 69 out of 309flct: progress  i = 70 out of 309flct: progress  i = 71 out of 309flct: progress  i = 72 out of 309flct: progress  i = 73 out of 309flct: progress  i = 74 out of 309flct: progress  i = 75 out of 309flct: progress  i = 76 out of 309flct: progress  i = 77 out of 309flct: progress  i = 78 out of 309flct: progress  i = 79 out of 309flct: progress  i = 80 out of 309flct: progress  i = 81 out of 309flct: progress  i = 82 out of 309flct: progress  i = 83 out of 309flct: progress  i = 84 out of 309flct: progress  i = 85 out of 309flct: progress  i = 86 out of 309flct: progress  i = 87 out of 309flct: progress  i = 88 out of 309flct: progress  i = 89 out of 309flct: progress  i = 90 out of 309flct: progress  i = 91 out of 309flct: progress  i = 92 out of 309flct: progress  i = 93 out of 309flct: progress  i = 94 out of 309flct: progress  i = 95 out of 309flct: progress  i = 96 out of 309flct: progress  i = 97 out of 309flct: progress  i = 98 out of 309flct: progress  i = 99 out of 309flct: progress  i = 100 out of 309flct: progress  i = 101 out of 309flct: progress  i = 102 out of 309flct: progress  i = 103 out of 309flct: progress  i = 104 out of 309flct: progress  i = 105 out of 309flct: progress  i = 106 out of 309flct: progress  i = 107 out of 309flct: progress  i = 108 out of 309flct: progress  i = 109 out of 309flct: progress  i = 110 out of 309flct: progress  i = 111 out of 309flct: progress  i = 112 out of 309flct: progress  i = 113 out of 309flct: progress  i = 114 out of 309flct: progress  i = 115 out of 309flct: progress  i = 116 out of 309flct: progress  i = 117 out of 309flct: progress  i = 118 out of 309flct: progress  i = 119 out of 309flct: progress  i = 120 out of 309flct: progress  i = 121 out of 309flct: progress  i = 122 out of 309flct: progress  i = 123 out of 309flct: progress  i = 124 out of 309flct: progress  i = 125 out of 309flct: progress  i = 126 out of 309flct: progress  i = 127 out of 309flct: progress  i = 128 out of 309flct: progress  i = 129 out of 309flct: progress  i = 130 out of 309flct: progress  i = 131 out of 309flct: progress  i = 132 out of 309flct: progress  i = 133 out of 309flct: progress  i = 134 out of 309flct: progress  i = 135 out of 309flct: progress  i = 136 out of 309flct: progress  i = 137 out of 309flct: progress  i = 138 out of 309flct: progress  i = 139 out of 309flct: progress  i = 140 out of 309flct: progress  i = 141 out of 309flct: progress  i = 142 out of 309flct: progress  i = 143 out of 309flct: progress  i = 144 out of 309flct: progress  i = 145 out of 309flct: progress  i = 146 out of 309flct: progress  i = 147 out of 309flct: progress  i = 148 out of 309flct: progress  i = 149 out of 309flct: progress  i = 150 out of 309flct: progress  i = 151 out of 309flct: progress  i = 152 out of 309flct: progress  i = 153 out of 309flct: progress  i = 154 out of 309flct: progress  i = 155 out of 309flct: progress  i = 156 out of 309flct: progress  i = 157 out of 309flct: progress  i = 158 out of 309flct: progress  i = 159 out of 309flct: progress  i = 160 out of 309flct: progress  i = 161 out of 309flct: progress  i = 162 out of 309flct: progress  i = 163 out of 309flct: progress  i = 164 out of 309flct: progress  i = 165 out of 309flct: progress  i = 166 out of 309flct: progress  i = 167 out of 309flct: progress  i = 168 out of 309flct: progress  i = 169 out of 309flct: progress  i = 170 out of 309flct: progress  i = 171 out of 309flct: progress  i = 172 out of 309flct: progress  i = 173 out of 309flct: progress  i = 174 out of 309flct: progress  i = 175 out of 309flct: progress  i = 176 out of 309flct: progress  i = 177 out of 309flct: progress  i = 178 out of 309flct: progress  i = 179 out of 309flct: progress  i = 180 out of 309flct: progress  i = 181 out of 309flct: progress  i = 182 out of 309flct: progress  i = 183 out of 309flct: progress  i = 184 out of 309flct: progress  i = 185 out of 309flct: progress  i = 186 out of 309flct: progress  i = 187 out of 309flct: progress  i = 188 out of 309flct: progress  i = 189 out of 309flct: progress  i = 190 out of 309flct: progress  i = 191 out of 309flct: progress  i = 192 out of 309flct: progress  i = 193 out of 309flct: progress  i = 194 out of 309flct: progress  i = 195 out of 309flct: progress  i = 196 out of 309flct: progress  i = 197 out of 309flct: progress  i = 198 out of 309flct: progress  i = 199 out of 309flct: progress  i = 200 out of 309flct: progress  i = 201 out of 309flct: progress  i = 202 out of 309flct: progress  i = 203 out of 309flct: progress  i = 204 out of 309flct: progress  i = 205 out of 309flct: progress  i = 206 out of 309flct: progress  i = 207 out of 309flct: progress  i = 208 out of 309flct: progress  i = 209 out of 309flct: progress  i = 210 out of 309flct: progress  i = 211 out of 309flct: progress  i = 212 out of 309flct: progress  i = 213 out of 309flct: progress  i = 214 out of 309flct: progress  i = 215 out of 309flct: progress  i = 216 out of 309flct: progress  i = 217 out of 309flct: progress  i = 218 out of 309flct: progress  i = 219 out of 309flct: progress  i = 220 out of 309flct: progress  i = 221 out of 309flct: progress  i = 222 out of 309flct: progress  i = 223 out of 309flct: progress  i = 224 out of 309flct: progress  i = 225 out of 309flct: progress  i = 226 out of 309flct: progress  i = 227 out of 309flct: progress  i = 228 out of 309flct: progress  i = 229 out of 309flct: progress  i = 230 out of 309flct: progress  i = 231 out of 309flct: progress  i = 232 out of 309flct: progress  i = 233 out of 309flct: progress  i = 234 out of 309flct: progress  i = 235 out of 309flct: progress  i = 236 out of 309flct: progress  i = 237 out of 309flct: progress  i = 238 out of 309flct: progress  i = 239 out of 309flct: progress  i = 240 out of 309flct: progress  i = 241 out of 309flct: progress  i = 242 out of 309flct: progress  i = 243 out of 309flct: progress  i = 244 out of 309flct: progress  i = 245 out of 309flct: progress  i = 246 out of 309flct: progress  i = 247 out of 309flct: progress  i = 248 out of 309flct: progress  i = 249 out of 309flct: progress  i = 250 out of 309flct: progress  i = 251 out of 309flct: progress  i = 252 out of 309flct: progress  i = 253 out of 309flct: progress  i = 254 out of 309flct: progress  i = 255 out of 309flct: progress  i = 256 out of 309flct: progress  i = 257 out of 309flct: progress  i = 258 out of 309flct: progress  i = 259 out of 309flct: progress  i = 260 out of 309flct: progress  i = 261 out of 309flct: progress  i = 262 out of 309flct: progress  i = 263 out of 309flct: progress  i = 264 out of 309flct: progress  i = 265 out of 309flct: progress  i = 266 out of 309flct: progress  i = 267 out of 309flct: progress  i = 268 out of 309flct: progress  i = 269 out of 309flct: progress  i = 270 out of 309flct: progress  i = 271 out of 309flct: progress  i = 272 out of 309flct: progress  i = 273 out of 309flct: progress  i = 274 out of 309flct: progress  i = 275 out of 309flct: progress  i = 276 out of 309flct: progress  i = 277 out of 309flct: progress  i = 278 out of 309flct: progress  i = 279 out of 309flct: progress  i = 280 out of 309flct: progress  i = 281 out of 309flct: progress  i = 282 out of 309flct: progress  i = 283 out of 309flct: progress  i = 284 out of 309flct: progress  i = 285 out of 309flct: progress  i = 286 out of 309flct: progress  i = 287 out of 309flct: progress  i = 288 out of 309flct: progress  i = 289 out of 309flct: progress  i = 290 out of 309flct: progress  i = 291 out of 309flct: progress  i = 292 out of 309flct: progress  i = 293 out of 309flct: progress  i = 294 out of 309flct: progress  i = 295 out of 309flct: progress  i = 296 out of 309flct: progress  i = 297 out of 309flct: progress  i = 298 out of 309flct: progress  i = 299 out of 309flct: progress  i = 300 out of 309flct: progress  i = 301 out of 309flct: progress  i = 302 out of 309flct: progress  i = 303 out of 309flct: progress  i = 304 out of 309flct: progress  i = 305 out of 309flct: progress  i = 306 out of 309flct: progress  i = 307 out of 309flct: progress  i = 308 out of 309flct: progress  i = 309 out of 309flct: mean value of gamma^2/sigma^2 = 0.195261

flct: finished
#+end_example

#+begin_src python :results output
import os
os.environ["PATH"] = ":".join((os.environ["PATH"], "/Users/will/.local/bin"))
os.system("echo $PATH")
os.system("which flct")
#+end_src

#+RESULTS:
: /Users/will/Source/google-cloud-sdk/bin:/usr/local/texlive/2017/bin/x86_64-darwin:/Users/will/anaconda/bin:/usr/local/bin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Library/TeX/texbin:/opt/X11/bin:/Users/will/Source/google-cloud-sdk/bin:/usr/local/texlive/2017/bin/x86_64-darwin:/Users/will/anaconda/bin:/Users/will/.local/bin
: /Users/will/.local/bin/flct

***** ~solve-astrometry-imslit-varias.sh~

#+name: imslit-list-varias
+ obj1002_bcr 
+ obj1006_bcr 
+ obj1009_bcr 
+ obj1012_bcr 
+ obj1017_bcr 
+ spm110_u
+ spm115_bcr 
+ spm118_bcr 
+ spm121_bcr 
+ spm124_bcr 
+ spm127_bcr 
+ spm134_bcr 
+ spm165_bcr 
+ spm223_bcr 
+ spm229_bcr 
+ spm318_bcr 
+ spm328_bcr 
+ spm331_bcr 
+ spm414_bcr 
+ spm236_bcr 
+ spm238_bcr 
+ spm242_bcr 
+ spm251_bcr 
+ spm256_bcr 
+ spm293_bcr 
+ spm296_bcr 
+ spm302_bcr 
+ spm303_bcr 
+ spm305_bcr 
+ spm306_bcr 
+ spm350_bcr 
+ spm358_bcr 
+ spm407_bcr
+ spm111_bcr
+ spm116_bcr
+ spm003_b
+ spm004_b
+ spm017_b

These have 512x512 arrays, so image pixels are bigger.  Use all the loose tolerances from the start

#+header: :var files=imslit-list-varias
#+begin_src sh :tangle ../scripts/solve-astrometry-imslit-varias.sh :eval no
  D=~/Dropbox/Papers/LL-Objects/NGC6210/Varias-temporadas
  for f in ${files[*]}; do
      solve-field --ra 251.1230 --dec 23.7999 --radius 0.1 --scale-units arcsecperpix --scale-low 0.5 --scale-high 0.8 --dir . --new-fits '%s-wcs.fits' --no-tweak --overwrite $D/${f}.fits --odds-to-solve 1e6 --quad-size-min 0.01 --code-tol 0.03
  done
#+end_src

Six failed with the more stringent limits.  Three we will try with looser limits

#+name: imslit-failed-varias
+ obj1002_bcr
+ obj1006_bcr
+ spm293_bcr
#+header: :var files=imslit-failed-varias
#+begin_src sh :tangle ../scripts/solve-astrometry-imslit-varias-failed.sh :eval no
  D=~/Dropbox/Papers/LL-Objects/NGC6210/Varias-temporadas
  for f in ${files[*]}; do
      solve-field --ra 251.1230 --dec 23.7999 --radius 0.1 --scale-units arcsecperpix --scale-low 0.5 --scale-high 0.8 --dir . --new-fits '%s-wcs.fits' --no-tweak --overwrite $D/${f}.fits --odds-to-solve 1e3 --quad-size-min 0.01 --code-tol 0.03
  done
#+end_src


But with 4 it is because the plate scale is smaller
#+name: imslit-1024-varias
+ spm003_b
+ spm004_b
+ spm017_b
+ spm019_b
+ spm021_b
+ spm111_cr
#+header: :var files=imslit-1024-varias
#+begin_src sh :tangle ../scripts/solve-astrometry-imslit-varias-1024.sh :eval no
  D=~/Dropbox/Papers/LL-Objects/NGC6210/Varias-temporadas
  for f in ${files[*]}; do
      solve-field --ra 251.1230 --dec 23.7999 --radius 0.1 --scale-units arcsecperpix --scale-low 0.3 --scale-high 0.4 --dir . --new-fits '%s-wcs.fits' --no-tweak --overwrite $D/${f}.fits --odds-to-solve 1e6 --quad-size-min 0.03 --code-tol 0.01
  done
#+end_src

+ [2019-06-04 Tue 18:20] Got extra file from Tere that was missing ~spm116-2~
  + I need to remove the bias myself
    + Measured to be median of 856
  + Also needed to remove cosmic rays in order for astrometry to work
    + All sorted now


Remove bias from file

#+begin_src python :results output :dir ~/Dropbox/Papers/LL-Objects/NGC6210/Varias-temporadas
  from astropy.io import fits
  hdulist = fits.open("spm116-2.fits")
  hdulist.info()
  hdu = hdulist[0]
  hdu.data = hdu.data.astype(float) - 856
  hdu.writeto("spm116-2_b.fits", overwrite=True)
#+end_src

#+RESULTS:
: Filename: spm116-2.fits
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU      30   (1076, 1024)   int16   

Remove cosmic rays 
#+begin_src python :results output :dir ~/Dropbox/Papers/LL-Objects/NGC6210/Varias-temporadas
  from astropy.io import fits
  from astroscrappy import detect_cosmics
  hdulist = fits.open("spm116-2_b.fits")
  hdulist.info()
  hdu = hdulist[0]
  mask, newdata = detect_cosmics(hdu.data)
  hdu.data = newdata
  hdu.writeto("spm116-2_bcr.fits", overwrite=True)
#+end_src

#+RESULTS:
: Filename: spm116-2_b.fits
: No.    Name      Ver    Type      Cards   Dimensions   Format
:   0  PRIMARY       1 PrimaryHDU      30   (1076, 1024)   float64   



#+name: imslit-missed
+ spm116-2_bcr
#+header: :var files=imslit-missed
#+begin_src sh :tangle ../scripts/solve-astrometry-imslit-varias-missed.sh :eval no
  D=~/Dropbox/Papers/LL-Objects/NGC6210/Varias-temporadas
  for f in ${files[*]}; do
      solve-field -v --ra 251.1230 --dec 23.7999 --radius 0.1 --scale-units arcsecperpix --scale-low 0.3 --scale-high 0.7 --dir . --new-fits '%s-wcs.fits' --no-tweak --overwrite $D/${f}.fits --odds-to-solve 1e2 --code-tol 0.03
  done
#+end_src

This finally worked

*** Compare the slit profiles with the reference profiles
+ In the Owl project, everything was all lumped together, but I am going to do things in stages
+ We don't know what ~shift~ values to use between the im+slit and the PV image, so we will plot the profile comparisons first
+ And first, we will just do Ha + [N II]
+ We will probably have to do it several times, in order to get the ~shift~ values
+ We can have a first guess by collapsing down the image and PV and looking at the location of maximum

#+begin_src python :tangle ../scripts/compare-slit-profiles.py
  import os
  import sys
  import numpy as np
  import astropy
  from astropy.table import Table, Row, hstack
  from astropy.io import fits
  from astropy.wcs import WCS
  from astropy.wcs.utils import pixel_to_skycoord
  from astropy import units as u
  from astropy.coordinates import SkyCoord
  import seaborn as sns
  import turtle_utils
  from turtle_utils import (
      slit_profile,
      extract_full_profile_from_pv,
      extract_slit_profile_from_imslit,
      get_orig_folder,
      find_slit_coords,
      subtract_sky_and_trim,
      make_three_plots,
      extract_line_and_regularize,
      make_slit_wcs,
  )

  try:
      choice = int(sys.argv[1])
  except:
      choice = None

  restwavs = {'ha': 6562.79, 'nii': 6583.45, 'nii_s': 6548.05}

  # Position of star
  RA0, Dec0 = 251.122998321, 23.7998586853

  saturation = 6e4


  sns.set_palette('RdPu_d', 3)

  table1 = Table.read('data/ha-slits.tab', format="ascii.tab")
  table2 =  Table.read('data/align-ha.tab', format="ascii.tab")
  # The align-ha table takes precedence if islit has been modified
  table1.remove_column("islit")
  # We already have spec in the ha-slits table
  table2.remove_column("spec") 
  table = hstack([table1, table2], join_type="exact")

  # Photometric reference image
  photom, = fits.open('data/imslit-ha/imslit-median.fits')
  wphot = WCS(photom.header)
  turtle_utils.VERBOSE = 1
  neighbors = [-2, -1, 1, 2]
  for row in table:
      if choice is not None and row["id"] != choice:
          # If we asked for a single spectrum, then skip all others
          continue
      spec_hdu, = fits.open(get_orig_folder(row["run"]) + "/" + row["spec"] + ".fits")
      im_hdu, = fits.open("data/imslit/" + row["imslit"] + "-wcs.fits")
      # Mask out saturated pixels with NaN
      spec_hdu.data[spec_hdu.data > saturation] = np.nan
      # trim the edge or arrays since sometimes the outer pixels contain garbage
      spec_hdu.data = subtract_sky_and_trim(spec_hdu.data, row)
      spec_profile = extract_full_profile_from_pv(
          spec_hdu,
          wavaxis=row["wa"],
          bandwidth=90.0,
          linedict=restwavs)
      imslit_profile = extract_slit_profile_from_imslit(im_hdu.data, row)
      print(row)
      jslit = np.arange(len(spec_profile))
      # jslit0_spec = np.average(jslit, weights=spec_profile)
      # jslit0_imslit = np.average(jslit, weights=imslit_profile)
      # jslit0_spec = np.nanargmax(spec_profile)
      # jslit0_imslit = np.nanargmax(imslit_profile)
      jslit0_spec = row["j0_s"]
      jslit0_imslit = row["j0_i"]
      print(jslit0_spec, jslit0_imslit, 'shift =', row["shift"])
      slit_coords = find_slit_coords(row, im_hdu.header, spec_hdu.header)
      calib_profile = slit_profile(slit_coords['RA'], slit_coords['Dec'],
                                   photom.data, wphot)


      # Look at neighboring slit positions
      nb_calib_profiles = {}
      for nb in neighbors:
          nbrow = Table(row)[0]   # This is the trick to get a copy of the row
          nbrow["islit"] += nb
          nb_slit_coords = find_slit_coords(nbrow, im_hdu.header, spec_hdu.header)
          nb_calib_profiles[nb] = slit_profile(
              nb_slit_coords['RA'], nb_slit_coords['Dec'], photom.data, wphot)


      # Offset in arcsec along the slit
      slit_points = (np.arange(len(spec_profile)) - jslit0_spec)*slit_coords["ds"]
      # Extra correction for optical halos that show up at +/- 40 arcsec
      halo_mask = np.abs(np.abs(slit_points) - 40.0) < 10.0
      halo_correction = np.median(spec_profile[halo_mask])
      spec_profile -= halo_correction

      # Take a window about profile peak to normalize spec_profile
      jslice0 = slice(jslit0_spec-20, jslit0_spec+20)
      # propagate saturated pixels to the calibration profile
      calib_profile_nan = calib_profile.copy()
      calib_profile_nan[~np.isfinite(spec_profile)] = np.nan
      rat0 = np.nansum(spec_profile[jslice0])/np.nansum(calib_profile_nan[jslice0])
      print('Coarse calibration: ratio =', rat0)
      spec_profile /= rat0


      # Make a figure comparing the profiles
      plt_prefix = f"figs/{row.index:03d}-calib"
      ratio = make_three_plots(spec_profile, calib_profile, plt_prefix,
                               slit_points=slit_points,
                               neighbors=nb_calib_profiles, db=row, sdb=slit_coords)

      # Write out the flux-calibrated spectra
      spec_hdu.data -= halo_correction
      spec_hdu.data /= rat0
      save_prefix = f"data/pvextract/{row.index:03d}-{row['spec']}"
      # The default header has minimal changes from the original
      pvheader = fits.Header(spec_hdu.header, copy=True)

      for lineid, wav0 in restwavs.items():
          pvdata, contdata, wavs = extract_line_and_regularize(
              spec_hdu.data, WCS(spec_hdu.header), wav0, row)
          pvdata = pvdata[None, :, :]
          contdata = contdata[None, :, :]

          # Create a fancy WCS object for slit coordinates (and a simple one too)
          wslit, wsimp = make_slit_wcs(row, slit_coords, wavs, jslit0_spec)
          # Set the rest wavelength for this line
          wslit.wcs.restwav = (wav0*u.Angstrom).to(u.m).value
          pvheader.update(wsimp.to_header())
          pvheader.update(wslit.to_header(key='A'))
          pvheader['WEIGHT'] = rat0

          pvfile = f"{save_prefix}-{lineid}.fits"
          fits.PrimaryHDU(header=pvheader,
                          data=pvdata).writeto(pvfile, overwrite=True)
          fits.PrimaryHDU(header=pvheader,
                          data=contdata).writeto(pvfile.replace(".fits",
                                                                "-cont.fits"),
                                                 overwrite=True)
#+end_src

+ [X] How to deal with saturation?
  + Done with NaNs
+ Manual changes to alignment along-slit (j0) and across-slit (islit) 
  + 05 j0_i from 268 \to 273
    + Much better in core
  + 06 j0_i from 272 \to 274 AND islit from 263 \to 262
  + 09 j0_i 264 \to 266 AND islit 269.5 \to 268.5
    + Now almost perfect!
  + 12 j0_i 268 \to 264
    + Still not good
  + 13 j0_i 187 -> 190
  + 16 j0_i 644 \to 544
  + 17 j0_i \to 620 and invert sense of axis AND islit 483 \to 481.5
  + 18 j0_i 512 \to 492 (enormous shift) islit 496 \to 500
    + Still not great
  + 19, 20, 21 good near peak - bad in faint parts
  + 22 j0_i 446 \to 447
    + good near peak - bad in faint parts
  + 23 j0_i 448 \to 450 AND islit 476 \to 474
    + Pretty good on left side, but not on right
  + 24 good as is
  + 26 j0_i 544 \to 543 AND islit 478 \to 476
  + 27 j0_i 546 \to 536 AND islit 493 \to 492
    + Another nearly perfect one!


#+name: align-ha
| id | spec          | islit | j0_s |  j0_i | shift |
|----+---------------+-------+------+-------+-------|
| 00 | obj1003_bcrx  |   390 |  336 |   252 |    84 |
| 01 | obj1007_bcrx  |   388 |  325 |   243 |    82 |
| 02 | obj1010_bcrx  |   388 |  327 |   243 |    84 |
| 03 | obj1015_bcrx  | 390.5 |  335 |   254 |    81 |
| 04 | obj1018_bcrx  | 390.5 |  336 |   252 |    84 |
| 05 | spm112_bcrx   |   257 |  316 | 272.5 |  43.5 |
| 06 | spm116_bcrx   |   262 |  318 |   274 |    44 |
| 07 | spm119_bcrx   |   265 |  317 |   271 |    46 |
| 08 | spm122_bcrx   |   266 |  321 | 274.5 |  46.5 |
| 09 | spm125_bcrx   | 268.5 |  314 |   266 |    48 |
| 10 | spm130_bcrx   | 272.5 |  325 |   271 |    54 |
| 11 | spm135_bcrx   | 277.5 |  313 |   260 |    53 |
| 12 | spm224_bcrx   | 294.5 |  329 |   264 |    65 |
| 13 | spm230_bcrx   | 294.5 |  250 |   190 |    60 |
| 14 | spm329_bcrx   |   273 |  321 |   264 |    57 |
| 15 | spm112-2_bcrx |   531 |  509 |   589 |   -80 |
| 16 | spm018-bcrx   |   505 |  508 |   602 |   -94 |
| 17 | spm020-bcrx   | 481.5 |  529 |   622 |   -93 |
| 18 | spm023-bcrx   |   500 |  533 |   640 |  -107 |
| 19 | spm0031o_bcrx |   485 |  331 |   451 |  -120 |
| 20 | spm0037o_bcrx |   484 |  325 |   443 |  -118 |
| 21 | spm0043o_bcrx |   481 |  324 |   446 |  -122 |
| 22 | spm0049o_bcrx |   480 |  324 |   448 |  -124 |
| 23 | spm0057o_bcrx |   474 |  330 |   450 |  -120 |
| 24 | spm0110o_bcrx | 490.5 |  414 |   537 |  -123 |
| 25 | spm0116o_bcrx | 485.5 |  425 |   541 |  -116 |
| 26 | spm0124o_bcrx |   476 |  419 |   543 |  -124 |
| 27 | spm0173o_bcrx |   492 |  412 |   536 |  -124 |
| 28 | spm0179o_bcrx | 489.5 |  410 |   527 |  -117 |
| 29 | spm0186o_bcrx | 515.5 |  398 |   523 |  -125 |
#+TBLFM: $6=$4 - $5

#+call: save-slit-table(align-ha, "align-ha.tab")

#+RESULTS:
[[file:../data/align-ha.tab]]

*** Do the same for [O III]
#+begin_src python :tangle ../scripts/compare-slit-profiles-oiii.py
  import os
  import sys
  import numpy as np
  import astropy
  from astropy.table import Table, Row, hstack
  from astropy.io import fits
  from astropy.wcs import WCS
  from astropy.wcs.utils import pixel_to_skycoord
  from astropy import units as u
  from astropy.coordinates import SkyCoord
  import seaborn as sns
  import turtle_utils
  from turtle_utils import (
      slit_profile,
      extract_full_profile_from_pv,
      extract_slit_profile_from_imslit,
      get_orig_folder,
      find_slit_coords,
      subtract_sky_and_trim,
      make_three_plots,
      extract_line_and_regularize,
      make_slit_wcs,
  )

  try:
      choice = int(sys.argv[1])
  except:
      choice = None

  restwavs = {}

  # Position of star
  RA0, Dec0 = 251.122998321, 23.7998586853

  saturation = 6e4


  sns.set_palette('RdPu_d', 3)

  table1 = Table.read('data/oiii-slits.tab', format="ascii.tab")
  table2 =  Table.read('data/align-oiii.tab', format="ascii.tab")
  # The align-ha table takes precedence if islit has been modified
  table1.remove_column("islit")
  # We already have spec in the ha-slits table
  table2.remove_column("spec") 
  table = hstack([table1, table2], join_type="exact")



  # Photometric reference image
  photom, = fits.open('data/imslit-oiii/imslit-median.fits')
  wphot = WCS(photom.header)
  turtle_utils.VERBOSE = 1
  neighbors = [-2, -1, 1, 2]
  for row in table:
      if choice is not None and row["id"] != choice:
          # If we asked for a single spectrum, then skip all others
          continue
      spec_hdu, = fits.open(get_orig_folder(row["run"]) + "/" + row["spec"] + ".fits")
      im_hdu, = fits.open("data/imslit/" + row["imslit"] + "-wcs.fits")
      # Mask out saturated pixels with NaN
      spec_hdu.data[spec_hdu.data > saturation] = np.nan
      # trim the edge or arrays since sometimes the outer pixels contain garbage
      spec_hdu.data = subtract_sky_and_trim(spec_hdu.data, row)
      spec_profile = extract_full_profile_from_pv(
          spec_hdu,
          wavaxis=row["wa"],
          bandwidth=None,
          linedict=restwavs)
      imslit_profile = extract_slit_profile_from_imslit(im_hdu.data, row)
      print(row)
      jslit = np.arange(len(spec_profile))
      # jslit0_spec = np.average(jslit, weights=spec_profile)
      # jslit0_imslit = np.average(jslit, weights=imslit_profile)
      # 
      # 
      if row["j0_s"] >= 0:
          jslit0_spec = row["j0_s"]
          jslit0_imslit = row["j0_i"]
      else:
          # First time around, slit alignment with image is not yet determined
          # So just look for maxima in profiles as a first guess
          jslit0_spec = np.nanargmax(spec_profile)
          jslit0_imslit = np.nanargmax(imslit_profile)
          row["shift"] = jslit0_spec - jslit0_imslit
      print(jslit0_spec, jslit0_imslit, 'shift =', row["shift"])
      slit_coords = find_slit_coords(row, im_hdu.header, spec_hdu.header)
      calib_profile = slit_profile(slit_coords['RA'], slit_coords['Dec'],
                                   photom.data, wphot)


      # Look at neighboring slit positions
      nb_calib_profiles = {}
      for nb in neighbors:
          nbrow = Table(row)[0]   # This is the trick to get a copy of the row
          nbrow["islit"] += nb
          nb_slit_coords = find_slit_coords(nbrow, im_hdu.header, spec_hdu.header)
          nb_calib_profiles[nb] = slit_profile(
              nb_slit_coords['RA'], nb_slit_coords['Dec'], photom.data, wphot)


      # Offset in arcsec along the slit
      slit_points = (np.arange(len(spec_profile)) - jslit0_spec)*slit_coords["ds"]
      # Extra correction for bg from pixels > 60 arcsec from peak
      bg_mask = np.abs(np.abs(slit_points) - 60.0) < 10.0
      if np.any(bg_mask):
          bg_correction = np.mean(spec_profile[bg_mask])
      else:
          # If the slit is not long enough, just take the pixels near the ends
          bg_correction = (spec_profile[:5].mean() + spec_profile[-5:].mean())/2.0
      spec_profile -= bg_correction

      # Take a window about profile peak to normalize spec_profile
      jslice0 = slice(jslit0_spec-10, jslit0_spec+10)
      # propagate saturated pixels to the calibration profile
      calib_profile_nan = calib_profile.copy()
      calib_profile_nan[~np.isfinite(spec_profile)] = np.nan
      rat0 = np.nansum(spec_profile[jslice0])/np.nansum(calib_profile_nan[jslice0])
      print('Coarse calibration: ratio =', rat0)
      spec_profile /= rat0


      # Make a figure comparing the profiles
      plt_prefix = f"figs/{row.index:03d}-calib-oiii"
      ratio = make_three_plots(spec_profile, calib_profile, plt_prefix,
                               slit_points=slit_points,
                               neighbors=nb_calib_profiles,
                               db=row, sdb=slit_coords, linelabel="[O III]")

      # Write out the flux-calibrated spectra
      spec_hdu.data -= bg_correction
      spec_hdu.data /= rat0
      save_prefix = f"data/pvextract-oiii/{row.index:03d}-{row['spec']}"
      # The default header has minimal changes from the original
      pvheader = fits.Header(spec_hdu.header, copy=True)

      for lineid, wav0 in restwavs.items():
          pvdata, contdata, wavs = extract_line_and_regularize(
              spec_hdu.data, WCS(spec_hdu.header), wav0, row,
              dw=4.0, dwbg_in=3.0, dwbg_out=4.0)
          pvdata = pvdata[None, :, :]
          contdata = contdata[None, :, :]

          # Create a fancy WCS object for slit coordinates (and a simple one too)
          wslit, wsimp = make_slit_wcs(row, slit_coords, wavs, jslit0_spec)
          # Set the rest wavelength for this line
          wslit.wcs.restwav = (wav0*u.Angstrom).to(u.m).value
          pvheader.update(wsimp.to_header())
          pvheader.update(wslit.to_header(key='A'))
          pvheader['WEIGHT'] = rat0

          pvfile = f"{save_prefix}-{lineid}.fits"
          fits.PrimaryHDU(header=pvheader,
                          data=pvdata).writeto(pvfile, overwrite=True)
          fits.PrimaryHDU(header=pvheader,
                          data=contdata).writeto(pvfile.replace(".fits",
                                                                "-cont.fits"),
                                                 overwrite=True)
#+end_src

#+RESULTS:

First run through, try to determine j0_s, j0_i, and shift automatically

#+name: align-oiii
| id | spec              | islit | j0_s | j0_i | shift |
|----+-------------------+-------+------+------+-------|
| 00 | spm243-244_bcrx   |   275 |  368 |  316 |    52 |
| 01 | spm252_bcrx       |   280 |  363 |  308 |    55 |
| 02 | spm257_bcrx       |   285 |  329 |  271 |    58 |
| 03 | spm244_bcrx       |   275 |  355 |  304 |    51 |
| 04 | spm253_bcrx       |   280 |  360 |  304 |    56 |
| 05 | spm258_bcrx       |   285 |  330 |  271 |    59 |
| 06 | spm294_bcrx_oiii  |   262 |  133 |  238 |  -105 |
| 07 | spm297_bcrx       |   265 |  292 |  244 |    48 |
| 08 | spm114_bcrx_oiii  |   533 |   81 |  600 |  -519 |
| 09 | spm0033_bcrx_oiii | 485.5 |  200 |  444 |  -244 |
| 10 | spm0039_bcrx_oiii |   481 |  197 |  446 |  -249 |
| 11 | spm0045o_bcrx     |   479 |  323 |  447 |  -124 |
| 12 | spm0051_bcrx_oiii |   476 |  196 |  446 |  -250 |
| 13 | spm0059_oiii      |   475 |  168 |  418 |  -250 |
| 14 | spm0112_bcrx_oiii |   486 |  212 |  532 |  -320 |
| 15 | spm0118_bcrx_oiii |   482 |  221 |  548 |  -327 |
| 16 | spm0126_bcrx_oiii | 476.5 |  218 |  541 |  -323 |
| 17 | spm0175o_bcrx     | 489.5 |  410 |  529 |  -119 |
| 18 | spm0181_bcrx_oiii |   480 |  215 |  536 |  -321 |
| 19 | spm0188_oiii      |   508 |  176 |  502 |  -326 |
#+TBLFM: $6=$4 - $5

#+call: save-slit-table(align-oiii, "align-oiii.tab")

#+RESULTS:
[[file:../data/align-oiii.tab]]

+ 00 - j0_i 308 \to 318 and islit 275 \to 273
** Test the heliocentric correction machinery
+ This is completely re-implemented using astropy.coordinates instead of pyslalib.slalib
+ These are largely similar to Teresa's values, but there are differences of up to 0.5 km/s
+ Although I managed to get the old method working as well
  + In the table, ~Helio~ is the astropy result while ~Helio2~ is the slalib result
  + Apart from the opposite sign convention, there are small differences.  Teresa's values seem more similar to the slalib ones (usually within 0.1 km/s)
+ *Conclusion* stick with slalib for now

#+BEGIN_SRC python :return outtab
  import sys
  import os
  import glob
  from astropy.io import fits
  import astropy.coordinates as coord
  from astropy.wcs import WCS
  from astropy.time import Time
  import astropy.units as u
  sys.path.append('/Users/will/Dropbox/OrionWest')
  from helio_utils import helio_topo_from_header

  outtab = [['File', 'Date', 'JD', 'ST', 'RA', 'Dec', 'Helio', 'Helio2'], None]
  speclist = glob.glob('../data/pvextract/0*-ha.fits')
  spm = coord.EarthLocation.of_site("spm")
  for fn in sorted(speclist):
      hdr = fits.open(fn)[0].header
      w = WCS(hdr, key="A")
      wav, c = w.pixel_to_world(1, 1, 1)
      time = Time(w.wcs.dateobs)
      heliocorr = c.radial_velocity_correction(
          'barycentric', obstime=time, location=spm)
      heliocorr2 = helio_topo_from_header(hdr, usewcs='A')
      id_, _ = os.path.splitext(os.path.basename(fn))
      outtab.append([id_, time.iso.split()[0],
                     time.mjd,
                     hdr.get('ST'), hdr.get('RA'), hdr.get('DEC'),
                     '{:.2f}'.format(heliocorr.to(u.km/u.s).value),
                     '{:.2f}'.format(heliocorr2),
      ])
#+END_SRC

#+RESULTS:
| File                 |       Date |      JD |          ST |         RA |        Dec |  Helio | Helio2 |
|----------------------+------------+---------+-------------+------------+------------+--------+--------|
| 000-obj1003_bcrx-ha  | 1998-06-28 | 50992.0 |        None |   16:44:27 |  +23:49:18 | -10.23 |  10.96 |
| 001-obj1007_bcrx-ha  | 1998-06-28 | 50992.0 |        None |   16:44:27 |  +23:49:30 | -10.23 |  10.96 |
| 002-obj1010_bcrx-ha  | 1998-06-28 | 50992.0 |        None |   16:44:26 |  +23:49:41 | -10.23 |  10.96 |
| 003-obj1015_bcrx-ha  | 1998-06-28 | 50992.0 |        None |   16:44:26 |  +23:49:07 | -10.23 |  10.96 |
| 004-obj1018_bcrx-ha  | 1998-06-28 | 50992.0 |        None |   16:44:25 |  +23:49:00 | -10.23 |  10.96 |
| 005-spm112_bcrx-ha   | 2003-06-05 | 52795.0 |    12:52:39 | 16:44:33.1 |  +23:48:04 |  -2.70 |   2.72 |
| 006-spm116_bcrx-ha   | 2003-06-05 | 52795.0 |    13:39:05 | 16:44:34.6 |  +23:47:59 |  -2.70 |   2.77 |
| 007-spm119_bcrx-ha   | 2003-06-05 | 52795.0 |    14:19:50 | 16:44:33.2 |  +23:47:55 |  -2.70 |   2.81 |
| 008-spm122_bcrx-ha   | 2003-06-05 | 52795.0 |    15:00:09 | 16:44:33.4 |  +23:47:52 |  -2.70 |   2.87 |
| 009-spm125_bcrx-ha   | 2003-06-05 | 52795.0 |    15:40:59 | 16:44:33.6 |  +23:47:51 |  -2.70 |   2.93 |
| 010-spm130_bcrx-ha   | 2003-06-05 | 52795.0 |    16:58:37 | 16:44:37.3 |  +23:47:53 |  -2.70 |   3.06 |
| 011-spm135_bcrx-ha   | 2003-06-05 | 52795.0 |    17:33:41 | 16:44:39.6 |  +23:47:56 |  -2.70 |   3.11 |
| 012-spm224_bcrx-ha   | 2003-10-16 | 52928.0 |    20:14:28 | 16:44:35.5 |  +23:48:04 | -14.08 |  14.26 |
| 013-spm230_bcrx-ha   | 2003-10-16 | 52928.0 |    21:04:08 | 16:44:33.0 |  +23:48:17 | -14.08 |  14.30 |
| 014-spm329_bcrx-ha   | 2003-10-17 | 52929.0 |    21:03:29 | 16:44:41.7 |  +23:48:16 | -13.79 |  14.00 |
| 015-spm112-2_bcrx-ha | 2011-05-21 | 55702.0 |    13:13:44 | 16:44:58.3 |  +23:46:31 |   2.51 |  -2.50 |
| 016-spm018-bcrx-ha   | 2013-07-06 | 56479.0 |    16:47:45 | 16:45:07.1 | 23:46:20.0 | -12.53 |  12.90 |
| 017-spm020-bcrx-ha   | 2013-07-06 | 56479.0 |    17:26:00 | 16:45:05.8 | 23:46:20.0 | -12.53 |  12.96 |
| 018-spm023-bcrx-ha   | 2013-07-06 | 56479.0 |    18:04:36 | 16:45:05.9 | 23:46:21.0 | -12.53 |  13.02 |
| 019-spm0031o_bcrx-ha | 2015-08-18 | 57252.0 | 18:02:23.50 | 16:45:10.6 | 23:46:44.0 | -20.04 |  20.40 |
| 020-spm0037o_bcrx-ha | 2015-08-18 | 57252.0 | 18:54:04.96 | 16:45:09.9 | 23:46:45.0 | -20.04 |  20.47 |
| 021-spm0043o_bcrx-ha | 2015-08-18 | 57252.0 | 19:35:53.81 | 16:45:08.9 | 23:46:49.0 | -20.04 |  20.53 |
| 022-spm0049o_bcrx-ha | 2015-08-18 | 57252.0 | 20:13:41.00 | 16:45:08.1 | 23:46:54.0 | -20.04 |  20.57 |
| 023-spm0057o_bcrx-ha | 2015-08-18 | 57252.0 | 20:59:43.55 | 16:45:08.1 | 23:46:59.0 | -20.04 |  20.61 |
| 024-spm0110o_bcrx-ha | 2015-08-19 | 57253.0 | 17:48:56.19 | 16:45:08.7 | 23:46:43.0 | -20.10 |  20.44 |
| 025-spm0116o_bcrx-ha | 2015-08-19 | 57253.0 | 18:47:13.74 | 16:45:08.6 | 23:46:44.0 | -20.10 |  20.52 |
| 026-spm0124o_bcrx-ha | 2015-08-19 | 57253.0 | 20:19:25.85 | 16:45:05.1 | 23:46:52.0 | -20.10 |  20.63 |
| 027-spm0173o_bcrx-ha | 2015-08-20 | 57254.0 | 17:28:59.83 | 16:45:07.3 | 23:46:42.0 | -20.16 |  20.46 |
| 028-spm0179o_bcrx-ha | 2015-08-20 | 57254.0 | 18:15:15.41 | 16:45:06.5 | 23:46:41.0 | -20.16 |  20.53 |
| 029-spm0186o_bcrx-ha | 2015-08-20 | 57254.0 | 19:36:02.64 | 16:45:05.7 | 23:46:47.0 | -20.16 |  20.64 |
*** Make high-pass filtered maps
+ We already have the unsharp masked image from Beto, but that has some inappropriate labels on it
+ So I could make new ones from the HST images
+ This is based on a progream in the Luis Angel bow shock project
  + [[id:171A91D5-C0D6-4411-9DB2-C1AB76D18E61][New images of each group]]
#+begin_src python :tangle ../scripts/smooth-image.py
  import numpy as np
  import argh
  from astropy.io import fits
  from astropy.convolution import convolve_fft, Gaussian2DKernel

  def main(infile, width=16, twopass=False, threshold=1.5, vmin=0.0):
      hdu = fits.open(infile)[0]
      im = hdu.data
      gauss_kernel = Gaussian2DKernel(width)
      smoothim = convolve_fft(im, gauss_kernel)
      sharpim = im/smoothim

      if twopass:
          mask = (sharpim > threshold) | (im == 0.0)
          im[mask] = np.nan
          print('Starting second pass: N(masked) =', mask.sum())
          smoothim = convolve_fft(im, gauss_kernel, normalize_kernel=True)
          sharpim = im/smoothim

      # Mask out sharp image where smooth image is too faint
      sharpim[smoothim < vmin] = 1.0

      outhdu = fits.PrimaryHDU(data=smoothim, header=hdu.header)
      outfile = infile.replace(".fits", f"_smooth_{width}.fits")
      outhdu.writeto(outfile, overwrite=True)

      outhdu.data = sharpim
      outhdu.writeto(outfile.replace("_smooth_", "_sharp_"), overwrite=True)

  if __name__ == "__main__":
      argh.dispatch_command(main)
#+end_src

#+begin_src sh :results verbatim :dir ../propermotions/oiii
python ../../scripts/smooth-image.py oiii-ago1997-win.fits -w 8 -v 0.08
#+end_src

#+RESULTS:

#+begin_src sh :results verbatim :dir ../propermotions/nii
python ../../scripts/smooth-image.py n6210n1998sm.fits -w 8 
#+end_src

#+RESULTS:


#+begin_src sh :results verbatim
python ../scripts/smooth-image.py -h
#+end_src

#+RESULTS:
#+begin_example
usage: smooth-image.py [-h] [-w WIDTH] [--twopass] [--threshold THRESHOLD]
                       [-v VMIN]
                       infile

positional arguments:
  infile                -

optional arguments:
  -h, --help            show this help message and exit
  -w WIDTH, --width WIDTH
                        16
  --twopass             False
  --threshold THRESHOLD
                        1.5
  -v VMIN, --vmin VMIN  0.0
#+end_example

****** East lobe

| Lobe      | Slit |    x |    y | +/- ds |   V |  V' |  W | Note   |    R |   PA |
|-----------+------+------+------+--------+-----+-----+----+--------+------+------|
| E lobe    | A    | 14.6 |   -5 |      5 | -58 | -18 |    | weaker | 15.1 | 105. |
| IS/E lobe | B    |  9.2 |   -5 |      2 | -55 | -15 | 40 |        | 10.5 | 119. |
|-----------+------+------+------+--------+-----+-----+----+--------+------+------|
| E lobe    | A    | 14.6 |   -6 |      3 | -48 |  -8 |    | bright | 15.4 | 109. |
| E lobe    | B    |  9.2 |   -9 |      2 | -48 |  -8 | 40 |        | 12.9 | 134. |
| IS/E lobe | B    |  9.2 |   -5 |      2 | -44 |  -4 | 40 |        | 10.5 | 119. |
| E lobe    | B    |  9.2 | -9.5 |    4.5 | -40 |  +0 | 40 |        | 12.9 | 134. |
|-----------+------+------+------+--------+-----+-----+----+--------+------+------|
| E lobe    | A    | 14.6 |   -9 |      3 | -23 | +17 | 30 |        | 17.2 | 122. |
| E lobe    | B    |  9.2 |   -7 |      4 | -28 | +12 | 40 | weak   | 11.6 | 127. |
#+TBLFM: $7=$-1 - -40;%+d

****** Northern jet
| Lobe       | Slit |     x |    y | +/- ds |   V |  V' |  W | Note   |    R |   PA |
|------------+------+-------+------+--------+-----+-----+----+--------+------+------|
| N jet      | G    |  -7.1 | 14.5 |    1.5 | -30 | +10 | 20 | narrow | 16.1 | 334. |
| N jet      | H    |  -7.7 |   15 |      2 | -29 | +11 | 17 | bright | 16.9 | 333. |
| N lobe/jet | S    |    -7 |   17 |      3 | -27 | +13 | 23 | narrow | 17.3 | 338. |
|------------+------+-------+------+--------+-----+-----+----+--------+------+------|
| N lobe/jet | S    |  -6.5 |   16 |      3 | -18 | +22 | 35 |        | 17.3 | 338. |
| N lobe/jet | J    | -11.9 | 15.5 |    2.5 | -18 | +22 | 35 |        | 19.5 | 322. |
| N jet      | I    | -11.1 |   16 |      2 | -14 | +26 | 35 | broad  | 19.5 | 325. |
| N jet      | H    |  -7.7 |   15 |      2 | -13 | +27 | 30 | broad  | 16.9 | 333. |
| N jet      | G    |  -7.1 | 14.5 |    1.5 | -12 | +28 | 30 | broad  | 16.1 | 334. |
#+TBLFM: $7=$-1 - -40;%+d

****** North lobe
| Lobe       | Slit |     x |    y | +/- ds |   V |  V' |  W | Note           |    R |   PA |
|------------+------+-------+------+--------+-----+-----+----+----------------+------+------|
| N lobe     | R    |  -4.2 |   21 |      4 | -68 | -28 | 23 |                | 21.4 | 349. |
| N lobe     | G    |  -7.1 | 19.5 |    3.5 | -65 | -25 | 30 | narrow         | 20.8 | 340. |
| N lobe     | H    |  -7.7 |   20 |      3 | -63 | -23 | 25 |                | 21.4 | 339. |
| N lobe     | S    |    -7 |   17 |      2 | -60 | -20 | 50 | faint shoulder | 18.3 | 331. |
| N lobe cap | F    |  -3.9 |   20 |      4 | -54 | -14 | 40 |                | 20.4 | 349. |
|------------+------+-------+------+--------+-----+-----+----+----------------+------+------|
| N lobe     | E    |  -1.5 | 11.5 |    2.5 | -53 | -13 | 50 |                | 11.6 | 353. |
| N lobe     | S    |  -6.9 | 10.5 |      2 | -52 | -12 | 30 |                | 12.6 | 327. |
| N lobe     | F    |  -3.9 |   11 |      3 | -51 | -11 | 40 |                | 11.7 | 340. |
| K-NW       | G    |  -7.1 |  7.5 |    2.5 | -50 | -10 | 22 |                | 10.3 | 317. |
| K-NW       | H    |  -7.7 |    7 |      2 | -48 |  -8 | 20 |                | 10.4 | 312. |
|------------+------+-------+------+--------+-----+-----+----+----------------+------+------|
| N lobe?    | I    | -11.1 |  7.5 |    4.5 | -39 |  +1 | 26 |                | 13.4 | 304. |
| N lobe?    | J    | -11.9 | 15.5 |    4.5 | -37 |  +3 | 33 | maybe halo     | 19.5 | 322. |
|------------+------+-------+------+--------+-----+-----+----+----------------+------+------|
| N lobe     | H    |  -7.7 | 20.5 |    2.5 | -35 |  +5 | 38 | broad          | 21.9 | 339. |
| N lobe     | G    |  -7.1 | 20.5 |    2.5 | -34 |  +6 | 50 | broad          | 20.8 | 340. |
| N lobe     | R    |  -3.3 | 14.5 |    4.5 | -32 |  +8 | 40 |                | 14.9 | 347. |
| N lobe     | F    |  -3.9 |   12 |      4 | -32 |  +8 | 40 |                | 12.6 | 342. |
| N lobe     | E    |  -1.5 |   14 |      5 | -31 |  +9 | 40 |                | 14.1 | 354. |
| N lobe     | G    |  -7.1 | 10.5 |    2.5 | -30 | +10 | 15 | grad +/- 1     | 12.7 | 326. |
| N lobe     | H    |  -7.7 |  9.5 |    2.5 | -30 | +10 | 25 |                | 12.2 | 321. |
| N lobe     | S    |  -6.9 | 10.5 |      2 | -29 | +11 | 35 |                | 12.6 | 327. |
|------------+------+-------+------+--------+-----+-----+----+----------------+------+------|
#+TBLFM: $7=$-1 - -40;%+d

****** South lobe
| Lobe        | Slit |    x |     y | +/- ds |   V |  V' |  W | B          |    R |   PA |
|-------------+------+------+-------+--------+-----+-----+----+------------+------+------|
| S lobe      | C    |  4.9 | -13.5 |    2.5 | -72 | -32 | 25 |            | 14.4 | 160. |
| S lobe      | B    |  9.2 | -14.5 |    2.5 | -72 | -32 | 30 |            | 17.2 | 148. |
| S lobe      | C    |  4.9 |    -7 |      3 | -66 | -26 | 20 |            |  8.5 | 145. |
| S lobe      | U    |      |       |    2.5 | -60 | -20 | 20 |            |      |      |
| S lobe      | U    |  9.3 | -14.1 |      3 | -70 | -30 | 25 |            | 16.9 | 147. |
| S lobe      | D    |  1.9 | -14.5 |    5.5 | -61 | -21 | 30 |            | 14.6 | 173. |
|-------------+------+------+-------+--------+-----+-----+----+------------+------+------|
| S lobe cap  | B    |  9.2 |   -21 |      2 | -50 | -10 | 40 |            | 22.9 | 156. |
| S lobe cap  | S    |  4.4 |   -22 |    2.5 | -50 | -10 | 40 |            | 22.4 | 169. |
| S lobe      | D    |  1.9 | -14.5 |    5.5 | -48 |  -8 | 15 |            | 14.6 | 173. |
| S lobe cap  | C    |  4.9 | -22.5 |    1.5 | -48 |  -8 | 45 |            | 23.0 | 168. |
| S lobe      | R    |  0.9 | -12.5 |    2.5 | -47 |  -7 | 35 |            | 12.5 | 176. |
| S lobe      | C    |  4.9 |   -12 |      7 | -47 |  -7 | 20 | strongest  | 13.0 | 158. |
| S lobe edge | E    | -1.5 |   -12 |      3 | -47 |  -7 | 26 |            | 12.1 | 187. |
| S lobe      | U    |  7.9 | -11.8 |    2.5 | -46 |  -6 | 10 | bright     | 14.2 | 146. |
| S lobe      | S    |  0.9 | -12.3 |      3 | -44 |  -4 | 35 |            | 12.3 | 176. |
| S lobe cap  | D    |  1.9 |   -23 |      2 | -40 |  +0 | 30 |            | 22.6 | 175. |
|-------------+------+------+-------+--------+-----+-----+----+------------+------+------|
| S lobe      | R    |  1.5 | -19.5 |      2 | -38 |  +2 | 25 | halo?      | 18.6 | 175. |
| S lobe      | B    |  9.2 | -14.5 |    2.5 | -37 |  +3 | 23 |            | 17.2 | 148. |
| S lobe      | U    |  7.9 | -13.2 |    4.5 | -28 | +12 | 30 | grad +/- 2 | 14.2 | 146. |
| S lobe      | R    |  1.0 | -13.5 |    3.5 | -28 | +12 | 40 |            | 13.5 | 176. |
| S lobe edge | E    | -1.5 |   -12 |      3 | -28 | +12 | 35 |            | 12.1 | 187. |
| S lobe      | S    |  0.9 | -12.3 |      3 | -27 | +13 | 40 |            | 12.3 | 176. |
| S lobe      | C    |  4.9 |  -8.5 |    4.5 | -27 | +13 | 26 |            |  9.8 | 150. |
| S lobe      | D    |  1.9 | -14.5 |    5.5 | -24 | +16 | 30 |            | 14.6 | 173. |
|-------------+------+------+-------+--------+-----+-----+----+------------+------+------|
| S lobe cap  | R    |  2.5 |   -24 |      2 | -21 | +19 | 40 |            | 24.1 | 174. |
| S lobe cap  | S    |  4.4 |   -22 |    2.5 | -17 | +23 | 45 |            | 22.4 | 169. |
| S lobe cap  | D    |  1.9 | -23.5 |    1.5 | -17 | +23 | 30 |            | 23.6 | 175. |
| S lobe cap  | C    |  4.9 | -21.5 |    2.5 | -15 | +25 | 26 |            | 22.1 | 167. |
#+TBLFM: $7=$-1 - -40;%+d


****** W lobe
| Lobe    | Slit |     x | y | +/- ds |   V |  V' |  W | Note          |    R |   PA |
|---------+------+-------+---+--------+-----+-----+----+---------------+------+------|
| W lobe  | J    | -11.9 | 6 |      5 | -55 | -15 |    | weak shoulder | 13.3 | 297. |
| W lobe  | U    |   -16 | 3 |      5 | -54 | -14 |    | weaker        | 16.3 | 281. |
| W lobe  | K    | -16.3 | 4 |      4 | -54 | -14 |    | weak shoulder | 16.8 | 284. |
|---------+------+-------+---+--------+-----+-----+----+---------------+------+------|
| W lobe  | K    | -16.3 | 4 |      4 | -36 |  +4 | 26 | brightest     | 16.8 | 284. |
| W lobe  | J    | -11.9 | 6 |      5 | -35 |  +5 | 26 | narrowish     | 13.3 | 297. |
| W Lobe  | L    | -18.6 | 3 |      3 | -34 |  +6 | 25 |               | 18.8 | 279. |
| W lobe  | U    |   -16 | 3 |      5 | -32 |  +8 |    | grad +/- 4    | 16.3 | 281. |
|---------+------+-------+---+--------+-----+-----+----+---------------+------+------|
| W lobe  | J    | -11.9 | 6 |      5 | -21 | +19 |    | shoulder      | 13.3 | 297. |
| W lobe? | I    | -11.1 | 6 |      2 | -17 | +23 |    | weak shoulder | 12.6 | 298. |
#+TBLFM: $7=$-1 - -40;%+d


***** Original table of all components by slit
:PROPERTIES:
:ID:       8B9823A2-9A10-46D7-80CA-8BDDC69AEEEF
:END:
+ This data all comes from [[id:36BE5EAE-B082-400A-B020-09C3C46CD40F][Individual slit measurements for lobes]]
| Lobe        | Slit |     x |     y | +/- ds |   V |  W | Note               |    R |   PA |
|-------------+------+-------+-------+--------+-----+----+--------------------+------+------|
| Halo SE     | U    |    16 |   -19 |      5 | -40 | 15 |                    | 24.8 | 140. |
| W lobe      | U    |   -16 |     3 |      5 | -32 |    | grad +/- 4         | 16.3 | 281. |
| W lobe      | U    |   -16 |     3 |      5 | -54 |    | weaker             | 16.3 | 281. |
| S lobe      | U    |   7.9 | -11.8 |    4.5 | -46 | 10 | narrow, bright     | 14.2 | 146. |
| S lobe      | U    |   2.0 | -10.0 |    2.5 | -60 | 30 | shoulder           | 10.2 | 169. |
| S lobe      | U    |   7.9 | -11.8 |      3 | -28 | 30 | grad +/- 2         | 14.2 | 146. |
| S lobe      | U    |   9.3 | -14.1 |      3 | -70 | 25 |                    | 16.9 | 147. |
| Halo NW     | U    |   -27 |    11 |      7 | -40 | 35 |                    | 29.2 | 292. |
|-------------+------+-------+-------+--------+-----+----+--------------------+------+------|
| N lobe      | R    |  -4.2 |    21 |      4 | -68 | 23 |                    | 21.4 | 349. |
| N lobe      | R    |  -3.3 |  14.5 |    4.5 | -32 | 40 |                    | 14.9 | 347. |
| S lobe      | R    |   1.0 | -13.5 |    3.5 | -28 | 40 |                    | 13.5 | 176. |
| S lobe      | R    |   0.9 | -12.5 |    2.5 | -47 | 35 |                    | 12.5 | 176. |
| S lobe      | R    |   1.5 | -19.5 |      2 | -38 | 25 |                    | 19.6 | 176. |
| S lobe cap  | R    |   2.5 |   -24 |      2 | -21 | 40 |                    | 24.1 | 174. |
|-------------+------+-------+-------+--------+-----+----+--------------------+------+------|
| N lobe/jet  | S    |  -6.5 |    16 |      3 | -27 | 23 | narrow             | 17.3 | 338. |
| N lobe/jet  | S    |  -6.5 |    16 |      3 | -18 | 35 |                    | 17.3 | 338. |
| N lobe/jet  | S    |    -7 |    17 |      2 | -60 | 50 | faint shoulder     | 18.4 | 338. |
| N lobe      | S    |  -6.9 |  10.5 |      2 | -29 | 35 |                    | 12.6 | 327. |
| N lobe      | S    |  -6.9 |  10.5 |      2 | -52 | 30 |                    | 12.6 | 327. |
| S lobe      | S    |   0.9 | -12.3 |      3 | -27 | 40 |                    | 12.3 | 176. |
| S lobe      | S    |   0.9 | -12.3 |      3 | -44 | 35 |                    | 12.3 | 176. |
| S lobe cap  | S    |   4.4 |   -22 |    2.5 | -50 | 40 |                    | 22.4 | 169. |
| S lobe cap  | S    |   4.4 |   -22 |    2.5 | -17 | 45 |                    | 22.4 | 169. |
|-------------+------+-------+-------+--------+-----+----+--------------------+------+------|
| Halo SE     | A    |  14.6 |   -19 |      5 | -40 | 13 |                    | 24.0 | 142. |
| Halo NE     | A    |  14.6 |   +23 |     17 | -40 | 25 |                    | 27.2 |  32. |
| E lobe      | A    |  14.6 |    -7 |      5 | -58 |    | weaker             | 16.2 | 116. |
| E lobe      | A    |  14.6 |    -6 |      3 | -48 |    | bright             | 15.8 | 112. |
| E lobe      | A    |  14.6 |    -9 |      3 | -23 | 30 | shoulder           | 17.2 | 122. |
| Halo NE     | B    |   9.2 |    16 |      8 | -40 | 26 |                    | 18.5 |  30. |
| IS/E lobe   | B    |   9.2 |    -5 |      2 | -55 | 40 |                    | 10.5 | 119. |
| IS/E lobe   | B    |   9.2 |    -5 |      2 | -44 | 40 |                    | 10.5 | 119. |
| E lobe      | B    |   9.2 |    -7 |      4 | -28 | 40 | weak               | 11.6 | 127. |
| E lobe      | B    |   9.2 |    -9 |      2 | -48 | 40 |                    | 12.9 | 134. |
| E lobe      | B    |   9.2 |  -9.5 |    4.5 | -40 | 40 |                    | 13.2 | 136. |
| Halo        | B    |   9.2 | -14.5 |    2.5 | -37 | 23 |                    | 17.2 | 148. |
| S lobe      | B    |   9.2 | -14.5 |    2.5 | -72 | 30 |                    | 17.2 | 148. |
| S lobe cap  | B    |   9.2 |   -21 |      2 | -50 | 40 |                    | 22.9 | 156. |
| Halo N      | C    |   4.9 |  15.5 |    8.5 | -40 | 40 |                    | 16.3 |  18. |
| S lobe      | C    |   4.9 |    -7 |      3 | -66 | 20 |                    |  8.5 | 145. |
| S lobe      | C    |   4.9 |   -12 |      7 | -47 | 20 | strongest          | 13.0 | 158. |
| S lobe      | C    |   4.9 |  -8.5 |    4.5 | -27 | 26 |                    |  9.8 | 150. |
| S lobe      | C    |   4.9 | -13.5 |    2.5 | -72 | 25 |                    | 14.4 | 160. |
| S lobe cap  | C    |   4.9 | -22.5 |    1.5 | -48 | 45 |                    | 23.0 | 168. |
| S lobe cap  | C    |   4.9 | -21.5 |    2.5 | -15 | 26 |                    | 22.1 | 167. |
| Halo N      | D    |   1.9 |    17 |      8 | -39 | 35 |                    | 17.1 |   6. |
| S lobe      | D    |   1.9 | -14.5 |    5.5 | -61 | 30 |                    | 14.6 | 173. |
| S lobe      | D    |   1.9 | -14.5 |    5.5 | -48 | 15 |                    | 14.6 | 173. |
| S lobe      | D    |   1.9 | -14.5 |    5.5 | -24 | 30 |                    | 14.6 | 173. |
| S lobe cap  | D    |   1.9 |   -23 |      2 | -40 | 30 |                    | 23.1 | 175. |
| S lobe cap  | D    |   1.9 | -23.5 |    1.5 | -17 | 30 |                    | 23.6 | 175. |
| N lobe      | E    |  -1.5 |  11.5 |    2.5 | -53 | 50 |                    | 11.6 | 353. |
| N lobe      | E    |  -1.5 |    14 |      5 | -31 | 40 |                    | 14.1 | 354. |
| S lobe edge | E    |  -1.5 |   -12 |      3 | -47 | 26 |                    | 12.1 | 187. |
| S lobe edge | E    |  -1.5 |   -12 |      3 | -28 | 35 |                    | 12.1 | 187. |
| Halo S      | E    |  -1.5 |   -19 |      4 | -39 | 20 |                    | 19.1 | 185. |
| N lobe      | F    |  -3.9 |    11 |      3 | -51 | 40 |                    | 11.7 | 340. |
| N lobe      | F    |  -3.9 |    12 |      4 | -32 | 40 |                    | 12.6 | 342. |
| N lobe cap  | F    |  -3.9 |    20 |      4 | -54 | 40 |                    | 20.4 | 349. |
| Halo S      | F    |  -3.9 |   -13 |      3 | -38 | 25 | Inner halo         | 13.6 | 197. |
| Halo S      | F    |  -3.9 |   -20 |      4 | -38 | 15 | Outer halo         | 20.4 | 191. |
| N lobe      | G    |  -7.1 |  19.5 |    3.5 | -65 | 30 | narrow             | 20.8 | 340. |
| N lobe      | G    |  -7.1 |  20.5 |    2.5 | -34 | 50 | broad              | 21.7 | 341. |
| N jet       | G    |  -7.1 |  14.5 |    1.5 | -30 | 20 | narrow             | 16.1 | 334. |
| N jet       | G    |  -7.1 |  14.5 |    1.5 | -12 | 30 | broad              | 16.1 | 334. |
| N lobe      | G    |  -7.1 |  10.5 |    2.5 | -30 | 15 | narrow, grad +/- 1 | 12.7 | 326. |
| K-NW        | G    |  -7.1 |   7.5 |    2.5 | -50 | 22 |                    | 10.3 | 317. |
| Halo S      | G    |  -7.1 |   -12 |      3 | -37 | 40 | inner halo         | 13.9 | 211. |
| Halo S      | G    |  -7.1 |   -20 |      5 | -40 | 14 |                    | 21.2 | 200. |
| Halo N      | H    |  -7.7 |    30 |      5 | -40 | 15 | very weak          | 31.0 | 346. |
| N lobe      | H    |  -7.7 |    20 |      3 | -63 | 25 |                    | 21.4 | 339. |
| N lobe      | H    |  -7.7 |  20.5 |    2.5 | -35 | 38 | broad              | 21.9 | 339. |
| N jet       | H    |  -7.7 |    15 |      2 | -29 | 17 | narrow bright      | 16.9 | 333. |
| N jet       | H    |  -7.7 |    15 |      2 | -13 | 30 | broad              | 16.9 | 333. |
| N lobe      | H    |  -7.7 |   9.5 |    2.5 | -30 | 25 |                    | 12.2 | 321. |
| K-NW        | H    |  -7.7 |     7 |      2 | -48 | 20 |                    | 10.4 | 312. |
| Halo S      | H    |  -7.7 | -13.5 |    3.5 | -39 | 44 | inner halo         | 15.5 | 210. |
| Halo S      | H    |  -7.7 |   -21 |      4 | -39 | 13 | outer halo         | 22.4 | 200. |
| Halo NW     | I    | -11.1 |  27.5 |    4.5 | -40 | 20 |                    | 29.7 | 338. |
| N jet       | I    | -11.1 |    16 |      2 | -14 | 35 | broad              | 19.5 | 325. |
| Halo/N lobe | I    | -11.1 |    16 |      5 | -42 | 25 | weak shoulder      | 19.5 | 325. |
| N lobe?     | I    | -11.1 |   7.5 |    4.5 | -39 | 26 |                    | 13.4 | 304. |
| W lobe?     | I    | -11.1 |     6 |      2 | -17 |    | weak shoulder      | 12.6 | 298. |
| Halo SW     | I    | -11.1 |   -12 |      2 | -39 | 22 | inner halo         | 16.3 | 223. |
| Halo SW     | I    | -11.1 |   -18 |      4 | -40 | 17 | outer halo         | 21.1 | 212. |
| Halo knot   | J    | -11.9 |    66 |      4 | -40 | 20 |                    | 67.1 | 350. |
| Halo NW     | J    | -11.9 |    26 |      6 | -38 | 16 |                    | 28.6 | 335. |
| N lobe?     | J    | -11.9 |  15.5 |    4.5 | -37 | 25 | maybe halo         | 19.5 | 322. |
| N lobe/jet  | J    | -11.9 |  15.5 |    2.5 | -18 | 35 |                    | 19.5 | 322. |
| W lobe      | J    | -11.9 |     6 |      5 | -35 | 26 | narrowish, halo?   | 13.3 | 297. |
| W lobe      | J    | -11.9 |     6 |      5 | -55 |    | weak shoulder      | 13.3 | 297. |
| W lobe      | J    | -11.9 |     6 |      5 | -21 |    | shoulder           | 13.3 | 297. |
| Halo SW     | J    | -11.9 |   -16 |      6 | -40 | 14 |                    | 19.9 | 217. |
| Halo knot   | K    | -16.3 |    61 |      7 | -41 | 20 |                    | 63.1 | 345. |
| Halo knot   | K    | -16.3 |  43.5 |    2.5 | -39 | 20 |                    | 46.5 | 339. |
| Halo NW     | K    | -16.3 |    25 |      5 | -40 | 14 | outer halo         | 29.8 | 327. |
| Halo NW     | K    | -16.3 |    12 |      6 | -38 | 25 | inner halo         | 20.2 | 306. |
| W lobe      | K    | -16.3 |     4 |      4 | -36 | 26 | brightest          | 16.8 | 284. |
| W lobe      | K    | -16.3 |     4 |      4 | -54 |    | weak shoulder      | 16.8 | 284. |
| Halo SW     | K    | -16.3 |    -7 |      2 | -41 | 23 | inner halo         | 17.7 | 247. |
| Halo SW     | K    | -16.3 |   -14 |      5 | -40 | 15 | outer halo         | 21.5 | 229. |
| Halo knot   | L    | -18.6 |    62 |      4 | -38 | 20 |                    | 64.7 | 343. |
| Halo NW     | L    | -18.6 |    29 |      5 | -38 | 22 | outer halo         | 34.5 | 327. |
| Halo NW     | L    | -18.6 |    16 |      8 | -33 | 35 | inner halo         | 24.5 | 311. |
| Halo NW     | L    | -18.6 |    12 |      4 | -57 |    | halo shoulder      | 22.1 | 303. |
| Halo W      | L    | -18.6 |    -7 |      2 | -41 | 23 | inner halo         | 19.9 | 249. |
| Halo SW     | L    | -18.6 |   -14 |      5 | -40 | 15 | outer halo         | 23.3 | 233. |
| W Lobe      | L    | -18.6 |     3 |      3 | -34 | 25 |                    | 18.8 | 279. |
#+TBLFM: $9=hypot($3, $4);f1::$10=arctan2($3, $4) % 360 ;f0



**** Intermediate shell
+ Sector-by-sector
  | Slit |      x |    y |   PA |    R |     V |  dV |
  |------+--------+------+------+------+-------+-----|
  | F    |  -3.58 |   +7 | 333. |  7.9 | -41.5 | 9.5 |
  | D    |   2.27 |   +7 |  18. |  7.4 |   -42 |   0 |
  | D    |   2.27 | +8.5 |  15. |  8.8 | -40.5 | 4.5 |
  | C    |   5.18 |   +7 |  37. |  8.7 |   -48 |  10 |
  | B    |   9.52 |    0 |  90. |  9.5 |   -43 |   7 |
  |------+--------+------+------+------+-------+-----|
  | E    |  -1.16 |   -7 | 189. |  7.1 | -38.5 | 7.5 |
  | U    |   -2.5 |   -6 | 203. |  6.5 | -36.5 | 7.5 |
  | F    |  -3.58 |   -7 | 207. |  7.9 | -35.5 | 6.5 |
  | G    |  -6.82 | -7.5 | 222. | 10.1 |   -34 |   7 |
  | H    |  -7.29 | -7.5 | 224. | 10.5 | -33.5 | 5.5 |
  | I    | -10.59 | -2.5 | 257. | 10.9 |   -31 |  11 |
  | J    | -11.59 | -2.5 | 258. | 11.9 |   -28 |   0 |
  #+TBLFM: $4=arctan2($2, $3) % 360;f0::$5=hypot($2, $3);f1
+ Geometry is summarised in [[file:Turtle%20intermediate%20shell.pdf]]

**** Proper motions and 3D position/velocities of the knot complexes
+ Assume 10 mas/yr = 95 km/s
 | Complex       | V_r | V_t       | tan(i)           | inc          | V            | R_proj | R               |
 |---------------+-----+-----------+------------------+--------------+--------------+--------+-----------------|
 | NE Blue       | -45 | 43 +/- 9  | -0.956 +/- 0.200 | -44. +/- 6.  | 62. +/- 6.   |      5 | 7.2 +/- 0.8     |
 | SE Blue       | -30 | 47 +/- 9  | -1.567 +/- 0.300 | -57. +/- 5.  | 56. +/- 8.   |      5 | 6.0 +/- 0.3     |
 | SW Faint Blue | -26 | 24 +/- 9  | -0.923 +/- 0.346 | -43. +/- 11. | 35. +/- 6.   |      6 | 8.8 +/- 1.8     |
 | N Red         | +25 | [1 .. 10] | [0.040 .. 0.400] | [2. .. 22.]  | [25. .. 27.] |      4 | [10.7 .. 114.6] |
 | SW Red        | +39 | 22 +/- 9  | 0.564 +/- 0.231  | 29. +/- 10.  | 45. +/- 4.   |      7 | 14.4 +/- 4.5    |
 | K-NW          | +18 | 12 +/- 9  | 0.667 +/- 0.500  | 34. +/- 20.  | 22. +/- 5.   |      9 | 16.1 +/- 8.3    |
 | N Jet         | +23 | 62 +/- 9  | 2.696 +/- 0.391  | 70. +/- 3.   | 66. +/- 8.   |     15 | 16.0 +/- 0.3    |
 #+TBLFM: $4=$3/$2;f3::$5=arctan($4);f0::$6=sqrt($2**2 + $3**2);f0::$8=$-1/sin(abs($5));f1

+ So, the red N jet is moving closest to plane of sky (i = 70)
+ Followed by SE Blue complex (K-SE) at i = -57 (really i = 123)
+ Then NE Blue complex at -45 (135)
+ I have now done a sketch of all this, which shows the red complexes as farther out and slower.
+ Repeat but "correcting" the radial velocities by factor of 1.2 for the gas/pattern speed distinction
 | Complex       | V_r | V_t       | tan(i)           | inc          | V            | R_proj | R               |
 |---------------+-----+-----------+------------------+--------------+--------------+--------+-----------------|
 | NE Blue       | -45 | 43 +/- 9  | -0.796 +/- 0.167 | -39. +/- 6.  | 69. +/- 6.   |      5 | 7.9 +/- 1.0     |
 | SE Blue       | -30 | 47 +/- 9  | -1.306 +/- 0.250 | -53. +/- 5.  | 59. +/- 7.   |      5 | 6.3 +/- 0.4     |
 | SW Faint Blue | -26 | 24 +/- 9  | -0.769 +/- 0.288 | -38. +/- 10. | 39. +/- 5.   |      6 | 9.7 +/- 2.2     |
 | N Red         | +25 | [1 .. 10] | [0.033 .. 0.333] | [2. .. 18.]  | [30. .. 32.] |      4 | [12.9 .. 114.6] |
 | SW Red        | +39 | 22 +/- 9  | 0.470 +/- 0.192  | 25. +/- 9.   | 52. +/- 4.   |      7 | 16.6 +/- 5.6    |
 | K-NW          | +18 | 12 +/- 9  | 0.556 +/- 0.417  | 29. +/- 18.  | 25. +/- 4.   |      9 | 18.6 +/- 10.5   |
 | N Jet         | +23 | 62 +/- 9  | 2.246 +/- 0.326  | 66. +/- 3.   | 68. +/- 8.   |     15 | 16.4 +/- 0.4    |
 #+TBLFM: $4=$3/1.2 $2;f3::$5=arctan($4);f0::$6=sqrt((1.2 $2)**2 + $3**2);f0::$8=$-1/sin(abs($5));f1
+ [ ] I should divide up the side-view picture into a W and E half
  + and rotate it so that N-S is up-down and blue-red is left-right
  + The N Red complex would appear on both halves

** Multibinning
#+BEGIN_SRC sh :results verbatim :dir ../data/maps
  mdir=/Users/will/Dropbox/OrionWest
  ranges='+030+040 +020+030 +010+020 +000+010 -010+000 -020-010 -030-020 -040-030 -050-040 -060-050 -070-060 -080-070 -090-080'
  for vrange in $ranges -allvels; do
      python $mdir/multibin-map.py turtle-slits-ha$vrange.fits
      python $mdir/multibin-map.py turtle-slits-nii$vrange.fits
  done
#+END_SRC

#+RESULTS:
#+begin_example
Saving turtle-slits-ha+030+040-bin001.fits
Saving turtle-slits-ha+030+040-bin002.fits
Saving turtle-slits-ha+030+040-bin004.fits
Saving turtle-slits-ha+030+040-bin008.fits
Saving turtle-slits-ha+030+040-bin016.fits
Saving turtle-slits-ha+030+040-bin032.fits
Saving turtle-slits-ha+030+040-bin064.fits
Saving turtle-slits-nii+030+040-bin001.fits
Saving turtle-slits-nii+030+040-bin002.fits
Saving turtle-slits-nii+030+040-bin004.fits
Saving turtle-slits-nii+030+040-bin008.fits
Saving turtle-slits-nii+030+040-bin016.fits
Saving turtle-slits-nii+030+040-bin032.fits
Saving turtle-slits-nii+030+040-bin064.fits
Saving turtle-slits-ha+020+030-bin001.fits
Saving turtle-slits-ha+020+030-bin002.fits
Saving turtle-slits-ha+020+030-bin004.fits
Saving turtle-slits-ha+020+030-bin008.fits
Saving turtle-slits-ha+020+030-bin016.fits
Saving turtle-slits-ha+020+030-bin032.fits
Saving turtle-slits-ha+020+030-bin064.fits
Saving turtle-slits-nii+020+030-bin001.fits
Saving turtle-slits-nii+020+030-bin002.fits
Saving turtle-slits-nii+020+030-bin004.fits
Saving turtle-slits-nii+020+030-bin008.fits
Saving turtle-slits-nii+020+030-bin016.fits
Saving turtle-slits-nii+020+030-bin032.fits
Saving turtle-slits-nii+020+030-bin064.fits
Saving turtle-slits-ha+010+020-bin001.fits
Saving turtle-slits-ha+010+020-bin002.fits
Saving turtle-slits-ha+010+020-bin004.fits
Saving turtle-slits-ha+010+020-bin008.fits
Saving turtle-slits-ha+010+020-bin016.fits
Saving turtle-slits-ha+010+020-bin032.fits
Saving turtle-slits-ha+010+020-bin064.fits
Saving turtle-slits-nii+010+020-bin001.fits
Saving turtle-slits-nii+010+020-bin002.fits
Saving turtle-slits-nii+010+020-bin004.fits
Saving turtle-slits-nii+010+020-bin008.fits
Saving turtle-slits-nii+010+020-bin016.fits
Saving turtle-slits-nii+010+020-bin032.fits
Saving turtle-slits-nii+010+020-bin064.fits
Saving turtle-slits-ha+000+010-bin001.fits
Saving turtle-slits-ha+000+010-bin002.fits
Saving turtle-slits-ha+000+010-bin004.fits
Saving turtle-slits-ha+000+010-bin008.fits
Saving turtle-slits-ha+000+010-bin016.fits
Saving turtle-slits-ha+000+010-bin032.fits
Saving turtle-slits-ha+000+010-bin064.fits
Saving turtle-slits-nii+000+010-bin001.fits
Saving turtle-slits-nii+000+010-bin002.fits
Saving turtle-slits-nii+000+010-bin004.fits
Saving turtle-slits-nii+000+010-bin008.fits
Saving turtle-slits-nii+000+010-bin016.fits
Saving turtle-slits-nii+000+010-bin032.fits
Saving turtle-slits-nii+000+010-bin064.fits
Saving turtle-slits-ha-010+000-bin001.fits
Saving turtle-slits-ha-010+000-bin002.fits
Saving turtle-slits-ha-010+000-bin004.fits
Saving turtle-slits-ha-010+000-bin008.fits
Saving turtle-slits-ha-010+000-bin016.fits
Saving turtle-slits-ha-010+000-bin032.fits
Saving turtle-slits-ha-010+000-bin064.fits
Saving turtle-slits-nii-010+000-bin001.fits
Saving turtle-slits-nii-010+000-bin002.fits
Saving turtle-slits-nii-010+000-bin004.fits
Saving turtle-slits-nii-010+000-bin008.fits
Saving turtle-slits-nii-010+000-bin016.fits
Saving turtle-slits-nii-010+000-bin032.fits
Saving turtle-slits-nii-010+000-bin064.fits
Saving turtle-slits-ha-020-010-bin001.fits
Saving turtle-slits-ha-020-010-bin002.fits
Saving turtle-slits-ha-020-010-bin004.fits
Saving turtle-slits-ha-020-010-bin008.fits
Saving turtle-slits-ha-020-010-bin016.fits
Saving turtle-slits-ha-020-010-bin032.fits
Saving turtle-slits-ha-020-010-bin064.fits
Saving turtle-slits-nii-020-010-bin001.fits
Saving turtle-slits-nii-020-010-bin002.fits
Saving turtle-slits-nii-020-010-bin004.fits
Saving turtle-slits-nii-020-010-bin008.fits
Saving turtle-slits-nii-020-010-bin016.fits
Saving turtle-slits-nii-020-010-bin032.fits
Saving turtle-slits-nii-020-010-bin064.fits
Saving turtle-slits-ha-030-020-bin001.fits
Saving turtle-slits-ha-030-020-bin002.fits
Saving turtle-slits-ha-030-020-bin004.fits
Saving turtle-slits-ha-030-020-bin008.fits
Saving turtle-slits-ha-030-020-bin016.fits
Saving turtle-slits-ha-030-020-bin032.fits
Saving turtle-slits-ha-030-020-bin064.fits
Saving turtle-slits-nii-030-020-bin001.fits
Saving turtle-slits-nii-030-020-bin002.fits
Saving turtle-slits-nii-030-020-bin004.fits
Saving turtle-slits-nii-030-020-bin008.fits
Saving turtle-slits-nii-030-020-bin016.fits
Saving turtle-slits-nii-030-020-bin032.fits
Saving turtle-slits-nii-030-020-bin064.fits
Saving turtle-slits-ha-040-030-bin001.fits
Saving turtle-slits-ha-040-030-bin002.fits
Saving turtle-slits-ha-040-030-bin004.fits
Saving turtle-slits-ha-040-030-bin008.fits
Saving turtle-slits-ha-040-030-bin016.fits
Saving turtle-slits-ha-040-030-bin032.fits
Saving turtle-slits-ha-040-030-bin064.fits
Saving turtle-slits-nii-040-030-bin001.fits
Saving turtle-slits-nii-040-030-bin002.fits
Saving turtle-slits-nii-040-030-bin004.fits
Saving turtle-slits-nii-040-030-bin008.fits
Saving turtle-slits-nii-040-030-bin016.fits
Saving turtle-slits-nii-040-030-bin032.fits
Saving turtle-slits-nii-040-030-bin064.fits
Saving turtle-slits-ha-050-040-bin001.fits
Saving turtle-slits-ha-050-040-bin002.fits
Saving turtle-slits-ha-050-040-bin004.fits
Saving turtle-slits-ha-050-040-bin008.fits
Saving turtle-slits-ha-050-040-bin016.fits
Saving turtle-slits-ha-050-040-bin032.fits
Saving turtle-slits-ha-050-040-bin064.fits
Saving turtle-slits-nii-050-040-bin001.fits
Saving turtle-slits-nii-050-040-bin002.fits
Saving turtle-slits-nii-050-040-bin004.fits
Saving turtle-slits-nii-050-040-bin008.fits
Saving turtle-slits-nii-050-040-bin016.fits
Saving turtle-slits-nii-050-040-bin032.fits
Saving turtle-slits-nii-050-040-bin064.fits
Saving turtle-slits-ha-060-050-bin001.fits
Saving turtle-slits-ha-060-050-bin002.fits
Saving turtle-slits-ha-060-050-bin004.fits
Saving turtle-slits-ha-060-050-bin008.fits
Saving turtle-slits-ha-060-050-bin016.fits
Saving turtle-slits-ha-060-050-bin032.fits
Saving turtle-slits-ha-060-050-bin064.fits
Saving turtle-slits-nii-060-050-bin001.fits
Saving turtle-slits-nii-060-050-bin002.fits
Saving turtle-slits-nii-060-050-bin004.fits
Saving turtle-slits-nii-060-050-bin008.fits
Saving turtle-slits-nii-060-050-bin016.fits
Saving turtle-slits-nii-060-050-bin032.fits
Saving turtle-slits-nii-060-050-bin064.fits
Saving turtle-slits-ha-070-060-bin001.fits
Saving turtle-slits-ha-070-060-bin002.fits
Saving turtle-slits-ha-070-060-bin004.fits
Saving turtle-slits-ha-070-060-bin008.fits
Saving turtle-slits-ha-070-060-bin016.fits
Saving turtle-slits-ha-070-060-bin032.fits
Saving turtle-slits-ha-070-060-bin064.fits
Saving turtle-slits-nii-070-060-bin001.fits
Saving turtle-slits-nii-070-060-bin002.fits
Saving turtle-slits-nii-070-060-bin004.fits
Saving turtle-slits-nii-070-060-bin008.fits
Saving turtle-slits-nii-070-060-bin016.fits
Saving turtle-slits-nii-070-060-bin032.fits
Saving turtle-slits-nii-070-060-bin064.fits
Saving turtle-slits-ha-080-070-bin001.fits
Saving turtle-slits-ha-080-070-bin002.fits
Saving turtle-slits-ha-080-070-bin004.fits
Saving turtle-slits-ha-080-070-bin008.fits
Saving turtle-slits-ha-080-070-bin016.fits
Saving turtle-slits-ha-080-070-bin032.fits
Saving turtle-slits-ha-080-070-bin064.fits
Saving turtle-slits-nii-080-070-bin001.fits
Saving turtle-slits-nii-080-070-bin002.fits
Saving turtle-slits-nii-080-070-bin004.fits
Saving turtle-slits-nii-080-070-bin008.fits
Saving turtle-slits-nii-080-070-bin016.fits
Saving turtle-slits-nii-080-070-bin032.fits
Saving turtle-slits-nii-080-070-bin064.fits
Saving turtle-slits-ha-090-080-bin001.fits
Saving turtle-slits-ha-090-080-bin002.fits
Saving turtle-slits-ha-090-080-bin004.fits
Saving turtle-slits-ha-090-080-bin008.fits
Saving turtle-slits-ha-090-080-bin016.fits
Saving turtle-slits-ha-090-080-bin032.fits
Saving turtle-slits-ha-090-080-bin064.fits
Saving turtle-slits-nii-090-080-bin001.fits
Saving turtle-slits-nii-090-080-bin002.fits
Saving turtle-slits-nii-090-080-bin004.fits
Saving turtle-slits-nii-090-080-bin008.fits
Saving turtle-slits-nii-090-080-bin016.fits
Saving turtle-slits-nii-090-080-bin032.fits
Saving turtle-slits-nii-090-080-bin064.fits
Saving turtle-slits-ha-allvels-bin001.fits
Saving turtle-slits-ha-allvels-bin002.fits
Saving turtle-slits-ha-allvels-bin004.fits
Saving turtle-slits-ha-allvels-bin008.fits
Saving turtle-slits-ha-allvels-bin016.fits
Saving turtle-slits-ha-allvels-bin032.fits
Saving turtle-slits-ha-allvels-bin064.fits
Saving turtle-slits-nii-allvels-bin001.fits
Saving turtle-slits-nii-allvels-bin002.fits
Saving turtle-slits-nii-allvels-bin004.fits
Saving turtle-slits-nii-allvels-bin008.fits
Saving turtle-slits-nii-allvels-bin016.fits
Saving turtle-slits-nii-allvels-bin032.fits
Saving turtle-slits-nii-allvels-bin064.fits
#+end_example

#+BEGIN_SRC sh :results verbatim :dir ../data/maps
  mdir=/Users/will/Dropbox/OrionWest
  ranges='+040+050 -100-090 -110-100'
  for vrange in $ranges; do
      python $mdir/multibin-map.py turtle-slits-ha$vrange.fits
      python $mdir/multibin-map.py turtle-slits-nii$vrange.fits
  done
#+END_SRC

#+RESULTS:
#+begin_example
Saving turtle-slits-ha+040+050-bin001.fits
Saving turtle-slits-ha+040+050-bin002.fits
Saving turtle-slits-ha+040+050-bin004.fits
Saving turtle-slits-ha+040+050-bin008.fits
Saving turtle-slits-ha+040+050-bin016.fits
Saving turtle-slits-ha+040+050-bin032.fits
Saving turtle-slits-ha+040+050-bin064.fits
Saving turtle-slits-nii+040+050-bin001.fits
Saving turtle-slits-nii+040+050-bin002.fits
Saving turtle-slits-nii+040+050-bin004.fits
Saving turtle-slits-nii+040+050-bin008.fits
Saving turtle-slits-nii+040+050-bin016.fits
Saving turtle-slits-nii+040+050-bin032.fits
Saving turtle-slits-nii+040+050-bin064.fits
Saving turtle-slits-ha-100-090-bin001.fits
Saving turtle-slits-ha-100-090-bin002.fits
Saving turtle-slits-ha-100-090-bin004.fits
Saving turtle-slits-ha-100-090-bin008.fits
Saving turtle-slits-ha-100-090-bin016.fits
Saving turtle-slits-ha-100-090-bin032.fits
Saving turtle-slits-ha-100-090-bin064.fits
Saving turtle-slits-nii-100-090-bin001.fits
Saving turtle-slits-nii-100-090-bin002.fits
Saving turtle-slits-nii-100-090-bin004.fits
Saving turtle-slits-nii-100-090-bin008.fits
Saving turtle-slits-nii-100-090-bin016.fits
Saving turtle-slits-nii-100-090-bin032.fits
Saving turtle-slits-nii-100-090-bin064.fits
Saving turtle-slits-ha-110-100-bin001.fits
Saving turtle-slits-ha-110-100-bin002.fits
Saving turtle-slits-ha-110-100-bin004.fits
Saving turtle-slits-ha-110-100-bin008.fits
Saving turtle-slits-ha-110-100-bin016.fits
Saving turtle-slits-ha-110-100-bin032.fits
Saving turtle-slits-ha-110-100-bin064.fits
Saving turtle-slits-nii-110-100-bin001.fits
Saving turtle-slits-nii-110-100-bin002.fits
Saving turtle-slits-nii-110-100-bin004.fits
Saving turtle-slits-nii-110-100-bin008.fits
Saving turtle-slits-nii-110-100-bin016.fits
Saving turtle-slits-nii-110-100-bin032.fits
Saving turtle-slits-nii-110-100-bin064.fits
Saving turtle-slits-ha-allvels-bin001.fits
Saving turtle-slits-ha-allvels-bin002.fits
Saving turtle-slits-ha-allvels-bin004.fits
Saving turtle-slits-ha-allvels-bin008.fits
Saving turtle-slits-ha-allvels-bin016.fits
Saving turtle-slits-ha-allvels-bin032.fits
Saving turtle-slits-ha-allvels-bin064.fits
Saving turtle-slits-nii-allvels-bin001.fits
Saving turtle-slits-nii-allvels-bin002.fits
Saving turtle-slits-nii-allvels-bin004.fits
Saving turtle-slits-nii-allvels-bin008.fits
Saving turtle-slits-nii-allvels-bin016.fits
Saving turtle-slits-nii-allvels-bin032.fits
Saving turtle-slits-nii-allvels-bin064.fits
#+end_example

#+BEGIN_SRC sh :results verbatim :dir ../data/maps20
  mdir=/Users/will/Dropbox/OrionWest
  ranges='+040+060 +020+040 +000+020 -020+000 -040-020 -060-040 -080-060 -100-080 -120-100'
  for vrange in $ranges; do
      python $mdir/multibin-map.py turtle-slits-ha$vrange.fits
      python $mdir/multibin-map.py turtle-slits-nii$vrange.fits
  done
#+END_SRC

#+RESULTS:
#+begin_example
Saving turtle-slits-ha+040+060-bin001.fits
Saving turtle-slits-ha+040+060-bin002.fits
Saving turtle-slits-ha+040+060-bin004.fits
Saving turtle-slits-ha+040+060-bin008.fits
Saving turtle-slits-ha+040+060-bin016.fits
Saving turtle-slits-ha+040+060-bin032.fits
Saving turtle-slits-ha+040+060-bin064.fits
Saving turtle-slits-nii+040+060-bin001.fits
Saving turtle-slits-nii+040+060-bin002.fits
Saving turtle-slits-nii+040+060-bin004.fits
Saving turtle-slits-nii+040+060-bin008.fits
Saving turtle-slits-nii+040+060-bin016.fits
Saving turtle-slits-nii+040+060-bin032.fits
Saving turtle-slits-nii+040+060-bin064.fits
Saving turtle-slits-ha+020+040-bin001.fits
Saving turtle-slits-ha+020+040-bin002.fits
Saving turtle-slits-ha+020+040-bin004.fits
Saving turtle-slits-ha+020+040-bin008.fits
Saving turtle-slits-ha+020+040-bin016.fits
Saving turtle-slits-ha+020+040-bin032.fits
Saving turtle-slits-ha+020+040-bin064.fits
Saving turtle-slits-nii+020+040-bin001.fits
Saving turtle-slits-nii+020+040-bin002.fits
Saving turtle-slits-nii+020+040-bin004.fits
Saving turtle-slits-nii+020+040-bin008.fits
Saving turtle-slits-nii+020+040-bin016.fits
Saving turtle-slits-nii+020+040-bin032.fits
Saving turtle-slits-nii+020+040-bin064.fits
Saving turtle-slits-ha+000+020-bin001.fits
Saving turtle-slits-ha+000+020-bin002.fits
Saving turtle-slits-ha+000+020-bin004.fits
Saving turtle-slits-ha+000+020-bin008.fits
Saving turtle-slits-ha+000+020-bin016.fits
Saving turtle-slits-ha+000+020-bin032.fits
Saving turtle-slits-ha+000+020-bin064.fits
Saving turtle-slits-nii+000+020-bin001.fits
Saving turtle-slits-nii+000+020-bin002.fits
Saving turtle-slits-nii+000+020-bin004.fits
Saving turtle-slits-nii+000+020-bin008.fits
Saving turtle-slits-nii+000+020-bin016.fits
Saving turtle-slits-nii+000+020-bin032.fits
Saving turtle-slits-nii+000+020-bin064.fits
Saving turtle-slits-ha-020+000-bin001.fits
Saving turtle-slits-ha-020+000-bin002.fits
Saving turtle-slits-ha-020+000-bin004.fits
Saving turtle-slits-ha-020+000-bin008.fits
Saving turtle-slits-ha-020+000-bin016.fits
Saving turtle-slits-ha-020+000-bin032.fits
Saving turtle-slits-ha-020+000-bin064.fits
Saving turtle-slits-nii-020+000-bin001.fits
Saving turtle-slits-nii-020+000-bin002.fits
Saving turtle-slits-nii-020+000-bin004.fits
Saving turtle-slits-nii-020+000-bin008.fits
Saving turtle-slits-nii-020+000-bin016.fits
Saving turtle-slits-nii-020+000-bin032.fits
Saving turtle-slits-nii-020+000-bin064.fits
Saving turtle-slits-ha-040-020-bin001.fits
Saving turtle-slits-ha-040-020-bin002.fits
Saving turtle-slits-ha-040-020-bin004.fits
Saving turtle-slits-ha-040-020-bin008.fits
Saving turtle-slits-ha-040-020-bin016.fits
Saving turtle-slits-ha-040-020-bin032.fits
Saving turtle-slits-ha-040-020-bin064.fits
Saving turtle-slits-nii-040-020-bin001.fits
Saving turtle-slits-nii-040-020-bin002.fits
Saving turtle-slits-nii-040-020-bin004.fits
Saving turtle-slits-nii-040-020-bin008.fits
Saving turtle-slits-nii-040-020-bin016.fits
Saving turtle-slits-nii-040-020-bin032.fits
Saving turtle-slits-nii-040-020-bin064.fits
Saving turtle-slits-ha-060-040-bin001.fits
Saving turtle-slits-ha-060-040-bin002.fits
Saving turtle-slits-ha-060-040-bin004.fits
Saving turtle-slits-ha-060-040-bin008.fits
Saving turtle-slits-ha-060-040-bin016.fits
Saving turtle-slits-ha-060-040-bin032.fits
Saving turtle-slits-ha-060-040-bin064.fits
Saving turtle-slits-nii-060-040-bin001.fits
Saving turtle-slits-nii-060-040-bin002.fits
Saving turtle-slits-nii-060-040-bin004.fits
Saving turtle-slits-nii-060-040-bin008.fits
Saving turtle-slits-nii-060-040-bin016.fits
Saving turtle-slits-nii-060-040-bin032.fits
Saving turtle-slits-nii-060-040-bin064.fits
Saving turtle-slits-ha-080-060-bin001.fits
Saving turtle-slits-ha-080-060-bin002.fits
Saving turtle-slits-ha-080-060-bin004.fits
Saving turtle-slits-ha-080-060-bin008.fits
Saving turtle-slits-ha-080-060-bin016.fits
Saving turtle-slits-ha-080-060-bin032.fits
Saving turtle-slits-ha-080-060-bin064.fits
Saving turtle-slits-nii-080-060-bin001.fits
Saving turtle-slits-nii-080-060-bin002.fits
Saving turtle-slits-nii-080-060-bin004.fits
Saving turtle-slits-nii-080-060-bin008.fits
Saving turtle-slits-nii-080-060-bin016.fits
Saving turtle-slits-nii-080-060-bin032.fits
Saving turtle-slits-nii-080-060-bin064.fits
Saving turtle-slits-ha-100-080-bin001.fits
Saving turtle-slits-ha-100-080-bin002.fits
Saving turtle-slits-ha-100-080-bin004.fits
Saving turtle-slits-ha-100-080-bin008.fits
Saving turtle-slits-ha-100-080-bin016.fits
Saving turtle-slits-ha-100-080-bin032.fits
Saving turtle-slits-ha-100-080-bin064.fits
Saving turtle-slits-nii-100-080-bin001.fits
Saving turtle-slits-nii-100-080-bin002.fits
Saving turtle-slits-nii-100-080-bin004.fits
Saving turtle-slits-nii-100-080-bin008.fits
Saving turtle-slits-nii-100-080-bin016.fits
Saving turtle-slits-nii-100-080-bin032.fits
Saving turtle-slits-nii-100-080-bin064.fits
Saving turtle-slits-ha-120-100-bin001.fits
Saving turtle-slits-ha-120-100-bin002.fits
Saving turtle-slits-ha-120-100-bin004.fits
Saving turtle-slits-ha-120-100-bin008.fits
Saving turtle-slits-ha-120-100-bin016.fits
Saving turtle-slits-ha-120-100-bin032.fits
Saving turtle-slits-ha-120-100-bin064.fits
Saving turtle-slits-nii-120-100-bin001.fits
Saving turtle-slits-nii-120-100-bin002.fits
Saving turtle-slits-nii-120-100-bin004.fits
Saving turtle-slits-nii-120-100-bin008.fits
Saving turtle-slits-nii-120-100-bin016.fits
Saving turtle-slits-nii-120-100-bin032.fits
Saving turtle-slits-nii-120-100-bin064.fits
#+end_example

#+BEGIN_SRC sh :results verbatim :dir ../data/maps-oiii-20
  mdir=/Users/will/Dropbox/OrionWest
  ranges='+040+060 +020+040 +000+020 -020+000 -040-020 -060-040 -080-060 -100-080 -120-100'
  for vrange in $ranges; do
      python $mdir/multibin-map.py turtle-slits-oiii$vrange.fits
  done
#+END_SRC

#+RESULTS:
#+begin_example
Saving turtle-slits-oiii+040+060-bin001.fits
Saving turtle-slits-oiii+040+060-bin002.fits
Saving turtle-slits-oiii+040+060-bin004.fits
Saving turtle-slits-oiii+040+060-bin008.fits
Saving turtle-slits-oiii+040+060-bin016.fits
Saving turtle-slits-oiii+040+060-bin032.fits
Saving turtle-slits-oiii+040+060-bin064.fits
Saving turtle-slits-oiii+020+040-bin001.fits
Saving turtle-slits-oiii+020+040-bin002.fits
Saving turtle-slits-oiii+020+040-bin004.fits
Saving turtle-slits-oiii+020+040-bin008.fits
Saving turtle-slits-oiii+020+040-bin016.fits
Saving turtle-slits-oiii+020+040-bin032.fits
Saving turtle-slits-oiii+020+040-bin064.fits
Saving turtle-slits-oiii+000+020-bin001.fits
Saving turtle-slits-oiii+000+020-bin002.fits
Saving turtle-slits-oiii+000+020-bin004.fits
Saving turtle-slits-oiii+000+020-bin008.fits
Saving turtle-slits-oiii+000+020-bin016.fits
Saving turtle-slits-oiii+000+020-bin032.fits
Saving turtle-slits-oiii+000+020-bin064.fits
Saving turtle-slits-oiii-020+000-bin001.fits
Saving turtle-slits-oiii-020+000-bin002.fits
Saving turtle-slits-oiii-020+000-bin004.fits
Saving turtle-slits-oiii-020+000-bin008.fits
Saving turtle-slits-oiii-020+000-bin016.fits
Saving turtle-slits-oiii-020+000-bin032.fits
Saving turtle-slits-oiii-020+000-bin064.fits
Saving turtle-slits-oiii-040-020-bin001.fits
Saving turtle-slits-oiii-040-020-bin002.fits
Saving turtle-slits-oiii-040-020-bin004.fits
Saving turtle-slits-oiii-040-020-bin008.fits
Saving turtle-slits-oiii-040-020-bin016.fits
Saving turtle-slits-oiii-040-020-bin032.fits
Saving turtle-slits-oiii-040-020-bin064.fits
Saving turtle-slits-oiii-060-040-bin001.fits
Saving turtle-slits-oiii-060-040-bin002.fits
Saving turtle-slits-oiii-060-040-bin004.fits
Saving turtle-slits-oiii-060-040-bin008.fits
Saving turtle-slits-oiii-060-040-bin016.fits
Saving turtle-slits-oiii-060-040-bin032.fits
Saving turtle-slits-oiii-060-040-bin064.fits
Saving turtle-slits-oiii-080-060-bin001.fits
Saving turtle-slits-oiii-080-060-bin002.fits
Saving turtle-slits-oiii-080-060-bin004.fits
Saving turtle-slits-oiii-080-060-bin008.fits
Saving turtle-slits-oiii-080-060-bin016.fits
Saving turtle-slits-oiii-080-060-bin032.fits
Saving turtle-slits-oiii-080-060-bin064.fits
Saving turtle-slits-oiii-100-080-bin001.fits
Saving turtle-slits-oiii-100-080-bin002.fits
Saving turtle-slits-oiii-100-080-bin004.fits
Saving turtle-slits-oiii-100-080-bin008.fits
Saving turtle-slits-oiii-100-080-bin016.fits
Saving turtle-slits-oiii-100-080-bin032.fits
Saving turtle-slits-oiii-100-080-bin064.fits
Saving turtle-slits-oiii-120-100-bin001.fits
Saving turtle-slits-oiii-120-100-bin002.fits
Saving turtle-slits-oiii-120-100-bin004.fits
Saving turtle-slits-oiii-120-100-bin008.fits
Saving turtle-slits-oiii-120-100-bin016.fits
Saving turtle-slits-oiii-120-100-bin032.fits
Saving turtle-slits-oiii-120-100-bin064.fits
#+end_example

*** HST images for comparison
Teresa has some that are suitable, but we want to rescale it to make it more easily compared with our own images (divide by 15 for [O III] should put it on same scale as our median image)
#+begin_src python :results silent :dir ../data
  from astropy.io import fits

  hdu = fits.open("/Users/will/Dropbox/Papers/LL-Objects/NGC6210/HST/astrodrizzled/oiii-ene2008-original.fits")["SCI"]

  hdu.data /= 15.0

  hdu.writeto("hst-oiii-ene2008-rescaled.fits", overwrite=True)
#+end_src


One for [N II] too. 
#+begin_src python :results silent :dir ../data
  from astropy.io import fits

  hdu = fits.open("/Users/will/Dropbox/Papers/LL-Objects/NGC6210/HST/astrodrizzled/MAST_2014-10-09T1938/MAST_2014-10-09T1938/HST/2001336009/hst_11122_10_wfpc2_f658n_wf.fits")["SCI"]

  hdu.data /= 20.01

  hdu.writeto("hst-nii-11122_10-rescaled.fits", overwrite=True)
#+end_src

For Ha we use the ones in the top-level directory.  Only two, so take min to avoid CRs

#+begin_src python :results silent :dir ../data
  import numpy as np
  from astropy.io import fits
  ids = ["am", "bm"]
  hdus = [fits.open(
      f"/Users/will/Dropbox/Papers/LL-Objects/NGC6210/HST/u37b010{_}_drz.fits")["SCI"]
          for _ in ids]


  newdata = np.fmin(hdus[0].data, hdus[1].data)

  fits.PrimaryHDU(
      data=newdata*1.5,
      header=hdus[0].header
  ).writeto("hst-ha-wfc-rescaled.fits", overwrite=True)

#+end_src


#+begin_src python :return out_tab
  import glob
  from astropy.io import fits

  file_list = glob.glob("/Users/will/Dropbox/Papers/LL-Objects/NGC6210/HST/*_drz.fits")

  out_tab = [["Name", "Filter"], None]
  for fitsfile in sorted(file_list):
      hdu = 
      out_tab.append([hdu.header["ROOTNAME"], hdu.header.get("FILTNAM1")])

#+end_src

#+RESULTS:
| Name      | Filter |
|-----------+--------|
| u37b0101m | F437N  |
| u37b0102m | F437N  |
| u37b0103m | F437N  |
| u37b0104m | F487N  |
| u37b0105m | F487N  |
| u37b0106m | F502N  |
| u37b0107m | F502N  |
| u37b0108m | F547M  |
| u37b0109m | F547M  |
| u37b010am | F656N  |
| u37b010bm | F656N  |
| u37b010cm | F375N  |
| u37b010dm | F375N  |
| u39h0701t | F658N  |
| u39h0701t | F658N  |
| u39h0702t | F658N  |
| u4js0601r | F502N  |
| u4js0602r | F502N  |
| u4js0603r | F502N  |
| u4js0604r | F502N  |
| u4js0605m | F502N  |
| u4js0606r | F502N  |
| u4js0607r | F658N  |
| u4js0608r | F658N  |
| u4js0609r | F658N  |
| u4js060ar | F658N  |
| u4js060br | F658N  |
| u4js060cr | F658N  |
| u4js060dr | F555W  |
| u4js060er | F555W  |
| u4js060fr | F555W  |
| u4js060gr | F555W  |
| u4js060hr | F555W  |
| u66b0501r | F502N  |
| u66b0502r | F502N  |
| u66b0503r | F502N  |
| u66b0504r | F658N  |
| u66b0505r | F658N  |
| u66b0506r | F658N  |
| u66b0507r | F555W  |
| u66b0508r | F555W  |
| u8s10401m | F185W  |
| u8s10402m | F185W  |
| u8s10403m | F547M  |
| ua011001m | F502N  |
| ua011002m | F502N  |
| ua011003m | F656N  |
| ua011004m | F656N  |
| ua011005m | F658N  |
| ua011006m | F658N  |
| ua011007m | F658N  |

